# Pandas

### import library

In [152]:
import pandas as pd
from random import *

df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], columns=['A','B','C'] , index=['x','y','z'])
#rows and colums are the index numbers(0 to 1,2,3 ...) defualt

### intro to Dataframe

In [153]:
df.head()# values in head shows rows

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [154]:
df.tail()# values in tail shows rows

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [155]:
print('head : shows first rows(5 rows)\ntail : shows final rows(5 rows)')

head : shows first rows(5 rows)
tail : shows final rows(5 rows)

In [156]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [157]:
df.index

Index(['x', 'y', 'z'], dtype='object')

In [158]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [159]:
df.describe()

         A    B    C
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [160]:
print(df['A'].nunique())
print(df['B'].nunique())
print(df['C'].nunique())

print('or')

print(df.nunique())

3
3
3
or
A    3
B    3
C    3
dtype: int64

In [161]:
df.shape
#(rows , columns)

(3, 3)

In [162]:
df.size

9

### Dataframe from file

In [163]:
adver = pd.read_csv('Adver.csv')
# .xlsx > .csv > .feather > .parquet

In [164]:
adver.head()

   index     TV  Radio  News  Sales
0      1  230.1   37.8  69.2   22.1
1      2   44.5   39.3  45.1   10.4
2      3   17.2   45.9  69.3    9.3
3      4  151.5   41.3  58.5   18.5
4      5  180.8   10.8  58.4   12.9

In [165]:
adver1=adver.to_parquet
adver1

<bound method DataFrame.to_parquet of      index     TV  Radio  News  Sales
0        1  230.1   37.8  69.2   22.1
1        2   44.5   39.3  45.1   10.4
2        3   17.2   45.9  69.3    9.3
3        4  151.5   41.3  58.5   18.5
4        5  180.8   10.8  58.4   12.9
..     ...    ...    ...   ...    ...
195    196   38.2    3.7  13.8    7.6
196    197   94.2    4.9   8.1    9.7
197    198  177.0    9.3   6.4   12.8
198    199  283.6   42.0  66.2   25.5
199    200  232.1    8.6   8.7   13.4

[200 rows x 5 columns]>

### Accessing Data with Pandas

In [166]:
adver.head()

   index     TV  Radio  News  Sales
0      1  230.1   37.8  69.2   22.1
1      2   44.5   39.3  45.1   10.4
2      3   17.2   45.9  69.3    9.3
3      4  151.5   41.3  58.5   18.5
4      5  180.8   10.8  58.4   12.9

In [167]:
adver

     index     TV  Radio  News  Sales
0        1  230.1   37.8  69.2   22.1
1        2   44.5   39.3  45.1   10.4
2        3   17.2   45.9  69.3    9.3
3        4  151.5   41.3  58.5   18.5
4        5  180.8   10.8  58.4   12.9
..     ...    ...    ...   ...    ...
195    196   38.2    3.7  13.8    7.6
196    197   94.2    4.9   8.1    9.7
197    198  177.0    9.3   6.4   12.8
198    199  283.6   42.0  66.2   25.5
199    200  232.1    8.6   8.7   13.4

[200 rows x 5 columns]

In [168]:
display(adver)

     index     TV  Radio  News  Sales
0        1  230.1   37.8  69.2   22.1
1        2   44.5   39.3  45.1   10.4
2        3   17.2   45.9  69.3    9.3
3        4  151.5   41.3  58.5   18.5
4        5  180.8   10.8  58.4   12.9
..     ...    ...    ...   ...    ...
195    196   38.2    3.7  13.8    7.6
196    197   94.2    4.9   8.1    9.7
197    198  177.0    9.3   6.4   12.8
198    199  283.6   42.0  66.2   25.5
199    200  232.1    8.6   8.7   13.4

[200 rows x 5 columns]

In [169]:
adver.sample(5)
# give differente sample every time that Runs

     index     TV  Radio  News  Sales
148    149   38.0   40.3  11.9   10.9
121    122   18.8   21.7  50.4    7.0
21      22  237.4    5.1  23.5   12.5
186    187  139.5    2.1  26.6   10.3
62      63  239.3   15.5  27.3   15.7

In [170]:
adver.loc[111]

index    112.0
TV       241.7
Radio     38.0
News      23.2
Sales     21.8
Name: 111, dtype: float64

In [171]:
adver.loc[[74,33,113]]

     index     TV  Radio  News  Sales
74      75  213.4   24.6  13.1   17.0
33      34  265.6   20.0   0.3   17.4
113    114  209.6   20.6  10.7   15.9

In [172]:
adver.loc[5:8, 'TV']

5      8.7
6     57.5
7    120.2
8      8.6
Name: TV, dtype: float64

In [173]:
adver.loc[0:9,['Radio','Sales']]

   Radio  Sales
0   37.8   22.1
1   39.3   10.4
2   45.9    9.3
3   41.3   18.5
4   10.8   12.9
5   48.9    7.2
6   32.8   11.8
7   19.6   13.2
8    2.1    4.8
9    2.6   10.6

In [174]:
adver.iloc[1,[0,1,2,3]]

index     2.0
TV       44.5
Radio    39.3
News     45.1
Name: 1, dtype: float64

In [175]:
adver.iloc[0:9,[2,4]]

   Radio  Sales
0   37.8   22.1
1   39.3   10.4
2   45.9    9.3
3   41.3   18.5
4   10.8   12.9
5   48.9    7.2
6   32.8   11.8
7   19.6   13.2
8    2.1    4.8

In [176]:
print('loc: names and index , use with indexs that determinated')
print('iloc: just index , use with the real indexs')
print('ait = iloc')

loc: names and index , use with indexs that determinated
iloc: just index , use with the real indexs
ait = iloc

In [177]:
adver.index=adver['index']
adver.head()

       index     TV  Radio  News  Sales
index
1          1  230.1   37.8  69.2   22.1
2          2   44.5   39.3  45.1   10.4
3          3   17.2   45.9  69.3    9.3
4          4  151.5   41.3  58.5   18.5
5          5  180.8   10.8  58.4   12.9

In [178]:
adver.loc[1,'Sales'] = 21
print(adver.loc[1])

index      1.0
TV       230.1
Radio     37.8
News      69.2
Sales     21.0
Name: 1, dtype: float64

In [179]:
adver.iat[0,4]

np.float64(21.0)

In [180]:
adver.sort_values('Sales',ascending=True)

       index     TV  Radio  News  Sales
index
131      131    0.7   39.6   8.7    1.6
156      156    4.1   11.6   5.7    3.2
9          9    8.6    2.1   1.0    4.8
79        79    5.4   29.9   9.4    5.3
109      109   13.1    0.4  25.6    5.3
...      ...    ...    ...   ...    ...
37        37  266.9   43.8   5.0   25.4
148      148  243.2   49.0  44.3   25.4
199      199  283.6   42.0  66.2   25.5
184      184  287.6   43.0  71.8   26.2
176      176  276.9   48.9  41.8   27.0

[200 rows x 5 columns]

In [181]:
adver.sort_values('Sales',ascending=False)

       index     TV  Radio  News  Sales
index
176      176  276.9   48.9  41.8   27.0
184      184  287.6   43.0  71.8   26.2
199      199  283.6   42.0  66.2   25.5
37        37  266.9   43.8   5.0   25.4
99        99  289.7   42.3  51.2   25.4
...      ...    ...    ...   ...    ...
79        79    5.4   29.9   9.4    5.3
109      109   13.1    0.4  25.6    5.3
9          9    8.6    2.1   1.0    4.8
156      156    4.1   11.6   5.7    3.2
131      131    0.7   39.6   8.7    1.6

[200 rows x 5 columns]

In [182]:
adver.sort_values(['TV','Sales'],ascending=[1,0])
# 0 :false
# 1:true

       index     TV  Radio   News  Sales
index
131      131    0.7   39.6    8.7    1.6
156      156    4.1   11.6    5.7    3.2
79        79    5.4   29.9    9.4    5.3
57        57    7.3   28.1   41.4    5.5
127      127    7.8   38.9   50.6    6.6
...      ...    ...    ...    ...    ...
99        99  289.7   42.3   51.2   25.4
36        36  290.7    4.1    8.5   12.8
31        31  292.9   28.3   43.2   21.4
43        43  293.6   27.7    1.8   20.7
102      102  296.4   36.3  100.9   23.8

[200 rows x 5 columns]

In [183]:
for index , row in adver.iterrows():
    print(index)
    print(row)
    print('\n\n\n')

1
index      1.0
TV       230.1
Radio     37.8
News      69.2
Sales     21.0
Name: 1, dtype: float64




2
index     2.0
TV       44.5
Radio    39.3
News     45.1
Sales    10.4
Name: 2, dtype: float64




3
index     3.0
TV       17.2
Radio    45.9
News     69.3
Sales     9.3
Name: 3, dtype: float64




4
index      4.0
TV       151.5
Radio     41.3
News      58.5
Sales     18.5
Name: 4, dtype: float64




5
index      5.0
TV       180.8
Radio     10.8
News      58.4
Sales     12.9
Name: 5, dtype: float64




6
index     6.0
TV        8.7
Radio    48.9
News     75.0
Sales     7.2
Name: 6, dtype: float64




7
index     7.0
TV       57.5
Radio    32.8
News     23.5
Sales    11.8
Name: 7, dtype: float64




8
index      8.0
TV       120.2
Radio     19.6
News      11.6
Sales     13.2
Name: 8, dtype: float64




9
index    9.0
TV       8.6
Radio    2.1
News     1.0
Sales    4.8
Name: 9, dtype: float64




10
index     10.0
TV       199.8
Radio      2.6
News      21.2
Sales     10.6
Name: 10, dtype: float64




11
index    11.0
TV       66.1
Radio     5.8
News     24.2
Sales     8.6
Name: 11, dtype: float64




12
index     12.0
TV       214.7
Radio     24.0
News       4.0
Sales     17.4
Name: 12, dtype: float64




13
index    13.0
TV       23.8
Radio    35.1
News     65.9
Sales     9.2
Name: 13, dtype: float64




14
index    14.0
TV       97.5
Radio     7.6
News      7.2
Sales     9.7
Name: 14, dtype: float64




15
index     15.0
TV       204.1
Radio     32.9
News      46.0
Sales     19.0
Name: 15, dtype: float64




16
index     16.0
TV       195.4
Radio     47.7
News      52.9
Sales     22.4
Name: 16, dtype: float64




17
index     17.0
TV        67.8
Radio     36.6
News     114.0
Sales     12.5
Name: 17, dtype: float64




18
index     18.0
TV       281.4
Radio     39.6
News      55.8
Sales     24.4
Name: 18, dtype: float64




19
index    19.0
TV       69.2
Radio    20.5
News     18.3
Sales    11.3
Name: 19, dtype: float64




20
index     20.0
TV       147.3
Radio     23.9
News      19.1
Sales     14.6
Name: 20, dtype: float64




21
index     21.0
TV       218.4
Radio     27.7
News      53.4
Sales     18.0
Name: 21, dtype: float64




22
index     22.0
TV       237.4
Radio      5.1
News      23.5
Sales     12.5
Name: 22, dtype: float64




23
index    23.0
TV       13.2
Radio    15.9
News     49.6
Sales     5.6
Name: 23, dtype: float64




24
index     24.0
TV       228.3
Radio     16.9
News      26.2
Sales     15.5
Name: 24, dtype: float64




25
index    25.0
TV       62.3
Radio    12.6
News     18.3
Sales     9.7
Name: 25, dtype: float64




26
index     26.0
TV       262.9
Radio      3.5
News      19.5
Sales     12.0
Name: 26, dtype: float64




27
index     27.0
TV       142.9
Radio     29.3
News      12.6
Sales     15.0
Name: 27, dtype: float64




28

index     28.0
TV       240.1
Radio     16.7
News      22.9
Sales     15.9
Name: 28, dtype: float64




29
index     29.0
TV       248.8
Radio     27.1
News      22.9
Sales     18.9
Name: 29, dtype: float64




30
index    30.0
TV       70.6
Radio    16.0
News     40.8
Sales    10.5
Name: 30, dtype: float64




31
index     31.0
TV       292.9
Radio     28.3
News      43.2
Sales     21.4
Name: 31, dtype: float64




32
index     32.0
TV       112.9
Radio     17.4
News      38.6
Sales     11.9
Name: 32, dtype: float64




33
index    33.0
TV       97.2
Radio     1.5
News     30.0
Sales     9.6
Name: 33, dtype: float64




34
index     34.0
TV       265.6
Radio     20.0
News       0.3
Sales     17.4
Name: 34, dtype: float64




35
index    35.0
TV       95.7
Radio     1.4
News      7.4
Sales     9.5
Name: 35, dtype: float64




36
index     36.0
TV       290.7
Radio      4.1
News       8.5
Sales     12.8
Name: 36, dtype: float64




37
index     37.0
TV       266.9
Radio     43.8
News       5.0
Sales     25.4
Name: 37, dtype: float64




38
index    38.0
TV       74.7
Radio    49.4
News     45.7
Sales    14.7
Name: 38, dtype: float64




39
index    39.0
TV       43.1
Radio    26.7
News     35.1
Sales    10.1
Name: 39, dtype: float64




40
index     40.0
TV       228.0
Radio     37.7
News      32.0
Sales     21.5
Name: 40, dtype: float64




41
index     41.0
TV       202.5
Radio     22.3
News      31.6
Sales     16.6
Name: 41, dtype: float64




42
index     42.0
TV       177.0
Radio     33.4
News      38.7
Sales     17.1
Name: 42, dtype: float64




43
index     43.0
TV       293.6
Radio     27.7
News       1.8
Sales     20.7
Name: 43, dtype: float64




44
index     44.0
TV       206.9
Radio      8.4
News      26.4
Sales     12.9
Name: 44, dtype: float64




45
index    45.0
TV       25.1
Radio    25.7
News     43.3
Sales     8.5
Name: 45, dtype: float64




46
index     46.0
TV       175.1
Radio     22.5
News      31.5
Sales     14.9
Name: 46, dtype: float64




47
index    47.0
TV       89.7
Radio     9.9
News     35.7
Sales    10.6
Name: 47, dtype: float64




48
index     48.0
TV       239.9
Radio     41.5
News      18.5
Sales     23.2
Name: 48, dtype: float64




49
index     49.0
TV       227.2
Radio     15.8
News      49.9
Sales     14.8
Name: 49, dtype: float64




50
index    50.0
TV       66.9
Radio    11.7
News     36.8
Sales     9.7
Name: 50, dtype: float64




51
index     51.0
TV       199.8
Radio      3.1
News      34.6
Sales     11.4
Name: 51, dtype: float64




52
index     52.0
TV       100.4
Radio      9.6
News       3.6
Sales     10.7
Name: 52, dtype: float64




53
index     53.0
TV       216.4
Radio     41.7
News      39.6
Sales     22.6
Name: 53, dtype: float64




54
index     54.0
TV       182.6
Radio     46.2
News      58.7
Sales     21.2
Name: 54, dtype: float64




55
index     55.0
TV       262.7
Radio     28.8
News      15.9
Sales     20.2
Name: 55, dtype: float64




56
index     56.0
TV       198.9
Radio     49.4
News      60.0
Sales     23.7
Name: 56, dtype: float64




57
index    57.0
TV        7.3
Radio    28.1
News     41.4
Sales     5.5
Name: 57, dtype: float64




58
index     58.0
TV       136.2
Radio     19.2
News      16.6
Sales     13.2
Name: 58, dtype: float64




59
index     59.0
TV       210.8
Radio     49.6
News      37.7
Sales     23.8
Name: 59, dtype: float64




60
index     60.0
TV       210.7
Radio     29.5
News       9.3
Sales     18.4
Name: 60, dtype: float64




61
index    61.0
TV       53.5
Radio     2.0
News     21.4
Sales     8.1
Name: 61, dtype: float64




62
index     62.0
TV       261.3
Radio     42.7
News      54.7
Sales     24.2
Name: 62, dtype: float64




63
index     63.0
TV       239.3
Radio     15.5
News      27.3
Sales     15.7
Name: 63, dtype: float64




64
index     64.0
TV       102.7
Radio     29.6
News       8.4
Sales     14.0
Name: 64, dtype: float64




65
index     65.0
TV       131.1
Radio     42.8
News      28.9
Sales     18.0
Name: 65, dtype: float64




66
index    66.0
TV       69.0
Radio     9.3
News      0.9
Sales     9.3
Name: 66, dtype: float64




67
index    67.0
TV       31.5
Radio    24.6
News      2.2
Sales     9.5
Name: 67, dtype: float64




68
index     68.0
TV       139.3
Radio     14.5
News      10.2
Sales     13.4
Name: 68, dtype: float64




69
index     69.0
TV       237.4
Radio     27.5
News      11.0
Sales     18.9
Name: 69, dtype: float64




70
index     70.0
TV       216.8
Radio     43.9
News      27.2
Sales     22.3
Name: 70, dtype: float64




71
index     71.0
TV       199.1
Radio     30.6
News      38.7
Sales     18.3
Name: 71, dtype: float64




72
index     72.0
TV       109.8
Radio     14.3
News      31.7
Sales     12.4
Name: 72, dtype: float64




73
index    73.0
TV       26.8
Radio    33.0
News     19.3
Sales     8.8
Name: 73, dtype: float64




74
index     74.0
TV       129.4
Radio      5.7
News      31.3
Sales     11.0
Name: 74, dtype: float64




75
index     75.0
TV       213.4
Radio     24.6
News      13.1
Sales     17.0
Name: 75, dtype: float64




76
index    76.0
TV       16.9
Radio    43.7
News     89.4
Sales     8.7
Name: 76, dtype: float64




77
index    77.0
TV       27.5
Radio     1.6
News     20.7
Sales     6.9
Name: 77, dtype: float64




78
index     78.0
TV       120.5
Radio     28.5
News      14.2
Sales     14.2
Name: 78, dtype: float64




79
index    79.0
TV        5.4
Radio    29.9
News      9.4
Sales     5.3
Name: 79, dtype: float64




80
index     80.0
TV       116.0
Radio      7.7
News      23.1
Sales     11.0
Name: 80, dtype: float64




81
index    81.0
TV       76.4
Radio    26.7
News     22.3
Sales    11.8
Name: 81, dtype: float64




82
index     82.0
TV       239.8
Radio      4.1
News      36.9
Sales     12.3
Name: 82, dtype: float64




83
index    83.0
TV       75.3
Radio    20.3
News     32.5
Sales    11.3
Name: 83, dtype: float64




84
index    84.0
TV       68.4
Radio    44.5
News     35.6
Sales    13.6
Name: 84, dtype: float64




85
index     85.0
TV       213.5
Radio     43.0
News      33.8
Sales     21.7
Name: 85, dtype: float64




86
index     86.0
TV       193.2
Radio     18.4
News      65.7
Sales     15.2
Name: 86, dtype: float64




87
index    87.0
TV       76.3
Radio    27.5
News     16.0
Sales    12.0
Name: 87, dtype: float64




88
index     88.0
TV       110.7
Radio     40.6
News      63.2
Sales     16.0
Name: 88, dtype: float64




89
index    89.0
TV       88.3
Radio    25.5
News     73.4
Sales    12.9
Name: 89, dtype: float64




90
index     90.0
TV       109.8
Radio     47.8
News      51.4
Sales     16.7
Name: 90, dtype: float64




91
index     91.0
TV       134.3
Radio      4.9
News       9.3
Sales     11.2
Name: 91, dtype: float64




92
index    92.0
TV       28.6
Radio     1.5
News     33.0
Sales     7.3
Name: 92, dtype: float64




93
index     93.0
TV       217.7
Radio     33.5
News      59.0
Sales     19.4
Name: 93, dtype: float64




94
index     94.0
TV       250.9
Radio     36.5
News      72.3
Sales     22.2
Name: 94, dtype: float64




95
index     95.0
TV       107.4
Radio     14.0
News      10.9
Sales     11.5
Name: 95, dtype: float64




96
index     96.0
TV       163.3
Radio     31.6
News      52.9
Sales     16.9
Name: 96, dtype: float64




97
index     97.0
TV       197.6
Radio      3.5
News       5.9
Sales     11.7
Name: 97, dtype: float64




98
index     98.0
TV       184.9
Radio     21.0
News      22.0
Sales     15.5
Name: 98, dtype: float64




99
index     99.0
TV       289.7
Radio     42.3
News      51.2
Sales     25.4
Name: 99, dtype: float64




100
index    100.0
TV       135.2
Radio     41.7
News      45.9
Sales     17.2
Name: 100, dtype: float64




101
index    101.0
TV       222.4
Radio      4.3
News      49.8
Sales     11.7
Name: 101, dtype: float64




102
index    102.0
TV       296.4
Radio     36.3
News     100.9
Sales     23.8
Name: 102, dtype: float64




103
index    103.0
TV       280.2
Radio     10.1
News      21.4
Sales     14.8
Name: 103, dtype: float64




104
index    104.0
TV       187.9
Radio     17.2
News      17.9
Sales     14.7
Name: 104, dtype: float64




105
index    105.0
TV       238.2
Radio     34.3
News       5.3
Sales     20.7
Name: 105, dtype: float64




106
index    106.0
TV       137.9
Radio     46.4
News      59.0
Sales     19.2
Name: 106, dtype: float64




107
index    107.0
TV        25.0
Radio     11.0
News      29.7
Sales      7.2
Name: 107, dtype: float64




108
index    108.0
TV        90.4
Radio      0.3
News      23.2
Sales      8.7
Name: 108, dtype: float64




109
index    109.0
TV        13.1
Radio      0.4
News      25.6
Sales      5.3
Name: 109, dtype: float64




110
index    110.0
TV       255.4
Radio     26.9
News       5.5
Sales     19.8
Name: 110, dtype: float64




111
index    111.0
TV       225.8
Radio      8.2
News      56.5
Sales     13.4
Name: 111, dtype: float64




112
index    112.0
TV       241.7
Radio     38.0
News      23.2
Sales     21.8
Name: 112, dtype: float64




113
index    113.0
TV       175.7
Radio     15.4
News       2.4
Sales     14.1
Name: 113, dtype: float64




114
index    114.0
TV       209.6
Radio     20.6
News      10.7
Sales     15.9
Name: 114, dtype: float64




115
index    115.0
TV        78.2
Radio     46.8
News      34.5
Sales     14.6
Name: 115, dtype: float64




116
index    116.0
TV        75.1
Radio     35.0
News      52.7
Sales     12.6
Name: 116, dtype: float64




117
index    117.0
TV       139.2
Radio     14.3
News      25.6
Sales     12.2
Name: 117, dtype: float64




118
index    118.0
TV        76.4
Radio      0.8
News      14.8
Sales      9.4
Name: 118, dtype: float64




119
index    119.0
TV       125.7
Radio     36.9
News      79.2
Sales     15.9
Name: 119, dtype: float64




120
index    120.0
TV        19.4
Radio     16.0
News      22.3
Sales      6.6
Name: 120, dtype: float64




121
index    121.0
TV       141.3
Radio     26.8
News      46.2
Sales     15.5
Name: 121, dtype: float64




122
index    122.0
TV        18.8
Radio     21.7
News      50.4
Sales      7.0
Name: 122, dtype: float64




123
index    123.0
TV       224.0
Radio      2.4
News      15.6
Sales     11.6
Name: 123, dtype: float64




124
index    124.0
TV       123.1
Radio     34.6
News      12.4
Sales     15.2
Name: 124, dtype: float64




125
index    125.0
TV       229.5
Radio     32.3
News      74.2
Sales     19.7
Name: 125, dtype: float64




126
index    126.0
TV        87.2
Radio     11.8
News      25.9
Sales     10.6
Name: 126, dtype: float64




127
index    127.0
TV         7.8
Radio     38.9
News      50.6
Sales      6.6
Name: 127, dtype: float64




128
index    128.0
TV        80.2
Radio      0.0
News       9.2
Sales      8.8
Name: 128, dtype: float64




129
index    129.0
TV       220.3
Radio     49.0
News       3.2
Sales     24.7
Name: 129, dtype: float64




130
index    130.0
TV        59.6
Radio     12.0
News      43.1
Sales      9.7
Name: 130, dtype: float64




131
index    131.0
TV         0.7
Radio     39.6
News       8.7
Sales      1.6
Name: 131, dtype: float64




132
index    132.0
TV       265.2
Radio      2.9
News      43.0
Sales     12.7
Name: 132, dtype: float64




133
index    133.0
TV         8.4
Radio     27.2
News       2.1
Sales      5.7
Name: 133, dtype: float64




134
index    134.0
TV       219.8
Radio     33.5
News      45.1
Sales     19.6
Name: 134, dtype: float64




135
index    135.0
TV        36.9
Radio     38.6
News      65.6
Sales     10.8
Name: 135, dtype: float64




136
index    136.0
TV        48.3
Radio     47.0
News       8.5
Sales     11.6
Name: 136, dtype: float64




137
index    137.0
TV        25.6
Radio     39.0
News       9.3
Sales      9.5
Name: 137, dtype: float64




138
index    138.0
TV       273.7
Radio     28.9
News      59.7
Sales     20.8
Name: 138, dtype: float64




139
index    139.0
TV        43.0
Radio     25.9
News      20.5
Sales      9.6
Name: 139, dtype: float64




140
index    140.0
TV       184.9
Radio     43.9
News       1.7
Sales     20.7
Name: 140, dtype: float64




141
index    141.0
TV        73.4
Radio     17.0
News      12.9
Sales     10.9
Name: 141, dtype: float64




142
index    142.0
TV       193.7
Radio     35.4
News      75.6
Sales     19.2
Name: 142, dtype: float64




143
index    143.0
TV       220.5
Radio     33.2
News      37.9
Sales     20.1
Name: 143, dtype: float64




144
index    144.0
TV       104.6
Radio      5.7
News      34.4
Sales     10.4
Name: 144, dtype: float64




145
index    145.0
TV        96.2
Radio     14.8
News      38.9
Sales     11.4
Name: 145, dtype: float64




146
index    146.0
TV       140.3
Radio      1.9
News       9.0
Sales     10.3
Name: 146, dtype: float64




147
index    147.0
TV       240.1
Radio      7.3
News       8.7
Sales     13.2
Name: 147, dtype: float64




148
index    148.0
TV       243.2
Radio     49.0
News      44.3
Sales     25.4
Name: 148, dtype: float64




149
index    149.0
TV        38.0
Radio     40.3
News      11.9
Sales     10.9
Name: 149, dtype: float64




150
index    150.0
TV        44.7
Radio     25.8
News      20.6
Sales     10.1
Name: 150, dtype: float64




151
index    151.0
TV       280.7
Radio     13.9
News      37.0
Sales     16.1
Name: 151, dtype: float64




152
index    152.0
TV       121.0
Radio      8.4
News      48.7
Sales     11.6
Name: 152, dtype: float64




153
index    153.0
TV       197.6
Radio     23.3
News      14.2
Sales     16.6
Name: 153, dtype: float64




154
index    154.0
TV       171.3
Radio     39.7
News      37.7
Sales     19.0
Name: 154, dtype: float64




155
index    155.0
TV       187.8
Radio     21.1
News       9.5
Sales     15.6
Name: 155, dtype: float64




156
index    156.0
TV         4.1
Radio     11.6
News       5.7
Sales      3.2
Name: 156, dtype: float64




157
index    157.0
TV        93.9
Radio     43.5
News      50.5
Sales     15.3
Name: 157, dtype: float64




158
index    158.0
TV       149.8
Radio      1.3
News      24.3
Sales     10.1
Name: 158, dtype: float64




159
index    159.0
TV        11.7
Radio     36.9
News      45.2
Sales      7.3
Name: 159, dtype: float64




160
index    160.0
TV       131.7
Radio     18.4
News      34.6
Sales     12.9
Name: 160, dtype: float64




161
index    161.0
TV       172.5
Radio     18.1
News      30.7
Sales     14.4
Name: 161, dtype: float64




162
index    162.0
TV        85.7
Radio     35.8
News      49.3
Sales     13.3
Name: 162, dtype: float64




163
index    163.0
TV       188.4
Radio     18.1
News      25.6
Sales     14.9
Name: 163, dtype: float64




164
index    164.0
TV       163.5
Radio     36.8
News       7.4
Sales     18.0
Name: 164, dtype: float64




165
index    165.0
TV       117.2
Radio     14.7
News       5.4
Sales     11.9
Name: 165, dtype: float64




166
index    166.0
TV       234.5
Radio      3.4
News      84.8
Sales     11.9
Name: 166, dtype: float64




167
index    167.0
TV        17.9
Radio     37.6
News      21.6
Sales      8.0
Name: 167, dtype: float64




168
index    168.0
TV       206.8
Radio      5.2
News      19.4
Sales     12.2
Name: 168, dtype: float64




169
index    169.0
TV       215.4
Radio     23.6
News      57.6
Sales     17.1
Name: 169, dtype: float64




170
index    170.0
TV       284.3
Radio     10.6
News       6.4
Sales     15.0
Name: 170, dtype: float64




171
index    171.0
TV        50.0
Radio     11.6
News      18.4
Sales      8.4
Name: 171, dtype: float64




172
index    172.0
TV       164.5
Radio     20.9
News      47.4
Sales     14.5
Name: 172, dtype: float64




173
index    173.0
TV        19.6
Radio     20.1
News      17.0
Sales      7.6
Name: 173, dtype: float64




174
index    174.0
TV       168.4
Radio      7.1
News      12.8
Sales     11.7
Name: 174, dtype: float64




175
index    175.0
TV       222.4
Radio      3.4
News      13.1
Sales     11.5
Name: 175, dtype: float64




176
index    176.0
TV       276.9
Radio     48.9
News      41.8
Sales     27.0
Name: 176, dtype: float64




177
index    177.0
TV       248.4
Radio     30.2
News      20.3
Sales     20.2
Name: 177, dtype: float64




178
index    178.0
TV       170.2
Radio      7.8
News      35.2
Sales     11.7
Name: 178, dtype: float64




179
index    179.0
TV       276.7
Radio      2.3
News      23.7
Sales     11.8
Name: 179, dtype: float64




180
index    180.0
TV       165.6
Radio     10.0
News      17.6
Sales     12.6
Name: 180, dtype: float64




181
index    181.0
TV       156.6
Radio      2.6
News       8.3
Sales     10.5
Name: 181, dtype: float64




182
index    182.0
TV       218.5
Radio      5.4
News      27.4
Sales     12.2
Name: 182, dtype: float64




183
index    183.0
TV        56.2
Radio      5.7
News      29.7
Sales      8.7
Name: 183, dtype: float64




184
index    184.0
TV       287.6
Radio     43.0
News      71.8
Sales     26.2
Name: 184, dtype: float64




185
index    185.0
TV       253.8
Radio     21.3
News      30.0
Sales     17.6
Name: 185, dtype: float64




186
index    186.0
TV       205.0
Radio     45.1
News      19.6
Sales     22.6
Name: 186, dtype: float64




187
index    187.0
TV       139.5
Radio      2.1
News      26.6
Sales     10.3
Name: 187, dtype: float64




188
index    188.0
TV       191.1
Radio     28.7
News      18.2
Sales     17.3
Name: 188, dtype: float64




189
index    189.0
TV       286.0
Radio     13.9
News       3.7
Sales     15.9
Name: 189, dtype: float64




190
index    190.0
TV        18.7
Radio     12.1
News      23.4
Sales      6.7
Name: 190, dtype: float64




191
index    191.0
TV        39.5
Radio     41.1
News       5.8
Sales     10.8
Name: 191, dtype: float64




192
index    192.0
TV        75.5
Radio     10.8
News       6.0
Sales      9.9
Name: 192, dtype: float64




193
index    193.0
TV        17.2
Radio      4.1
News      31.6
Sales      5.9
Name: 193, dtype: float64




194
index    194.0
TV       166.8
Radio     42.0
News       3.6
Sales     19.6
Name: 194, dtype: float64




195
index    195.0
TV       149.7
Radio     35.6
News       6.0
Sales     17.3
Name: 195, dtype: float64




196
index    196.0
TV        38.2
Radio      3.7
News      13.8
Sales      7.6
Name: 196, dtype: float64




197
index    197.0
TV        94.2
Radio      4.9
News       8.1
Sales      9.7
Name: 197, dtype: float64




198
index    198.0
TV       177.0
Radio      9.3
News       6.4
Sales     12.8
Name: 198, dtype: float64




199
index    199.0
TV       283.6
Radio     42.0
News      66.2
Sales     25.5
Name: 199, dtype: float64




200
index    200.0
TV       232.1
Radio      8.6
News       8.7
Sales     13.4
Name: 200, dtype: float64

In [184]:
for index , row in adver.iterrows():
    print(index)
    print(row['Sales'])
    print('\n')

1
21.0


2
10.4


3
9.3


4
18.5


5
12.9


6
7.2


7
11.8


8
13.2


9
4.8


10
10.6


11
8.6


12
17.4


13
9.2


14
9.7


15
19.0


16
22.4


17
12.5


18
24.4


19
11.3


20
14.6


21
18.0


22
12.5


23
5.6


24
15.5


25
9.7


26
12.0


27
15.0


28
15.9


29
18.9


30
10.5


31
21.4


32
11.9


33
9.6


34
17.4


35
9.5


36
12.8


37
25.4


38
14.7


39
10.1


40
21.5


41
16.6


42
17.1


43
20.7


44
12.9


45
8.5


46
14.9


47
10.6


48
23.2


49
14.8


50
9.7


51
11.4


52
10.7


53
22.6


54
21.2


55
20.2


56
23.7


57
5.5


58
13.2


59
23.8


60
18.4


61
8.1


62
24.2


63
15.7


64
14.0


65
18.0


66
9.3


67
9.5


68
13.4


69
18.9


70
22.3


71
18.3


72
12.4


73
8.8


74
11.0


75
17.0


76
8.7


77
6.9


78
14.2


79
5.3


80
11.0


81
11.8


82
12.3


83
11.3


84
13.6


85
21.7


86
15.2


87
12.0


88
16.0


89
12.9


90
16.7


91
11.2


92
7.3


93
19.4


94
22.2


95
11.5


96
16.9


97
11.7


98
15.5


99
25.4


100
17.2


101
11.7


102
23.8


103
14.8


104
14.7


105
20.7


106
19.2


107
7.2


108
8.7


109
5.3


110
19.8


111
13.4


112
21.8


113
14.1


114
15.9


115
14.6


116
12.6


117
12.2


118
9.4


119
15.9


120
6.6


121
15.5


122
7.0


123
11.6


124
15.2


125
19.7


126
10.6


127
6.6


128
8.8


129
24.7


130
9.7


131
1.6


132
12.7


133
5.7


134
19.6


135
10.8


136
11.6


137
9.5


138
20.8


139
9.6


140
20.7


141
10.9


142
19.2


143
20.1


144
10.4


145
11.4


146
10.3


147
13.2


148
25.4


149
10.9


150
10.1


151
16.1


152
11.6


153
16.6


154
19.0


155
15.6


156
3.2


157
15.3


158
10.1


159
7.3


160
12.9


161
14.4


162
13.3


163
14.9


164
18.0


165
11.9


166
11.9


167
8.0


168
12.2


169
17.1


170
15.0


171
8.4


172
14.5


173
7.6


174
11.7


175
11.5


176
27.0


177
20.2


178
11.7


179
11.8


180
12.6


181
10.5


182
12.2


183
8.7


184
26.2


185
17.6


186
22.6


187
10.3


188
17.3


189
15.9


190
6.7


191
10.8


192
9.9


193
5.9


194
19.6


195
17.3


196
7.6


197
9.7


198
12.8


199
25.5


200
13.4

### Filtering Data

In [185]:
adver.loc[adver['Sales'] > 20,['Radio','Sales']]

       Radio  Sales
index
1       37.8   21.0
16      47.7   22.4
18      39.6   24.4
31      28.3   21.4
37      43.8   25.4
40      37.7   21.5
43      27.7   20.7
48      41.5   23.2
53      41.7   22.6
54      46.2   21.2
55      28.8   20.2
56      49.4   23.7
59      49.6   23.8
62      42.7   24.2
70      43.9   22.3
85      43.0   21.7
94      36.5   22.2
99      42.3   25.4
102     36.3   23.8
105     34.3   20.7
112     38.0   21.8
129     49.0   24.7
138     28.9   20.8
140     43.9   20.7
143     33.2   20.1
148     49.0   25.4
176     48.9   27.0
177     30.2   20.2
184     43.0   26.2
186     45.1   22.6
199     42.0   25.5

In [186]:
adver[adver['Sales'] > 20][['Radio','Sales']]

       Radio  Sales
index
1       37.8   21.0
16      47.7   22.4
18      39.6   24.4
31      28.3   21.4
37      43.8   25.4
40      37.7   21.5
43      27.7   20.7
48      41.5   23.2
53      41.7   22.6
54      46.2   21.2
55      28.8   20.2
56      49.4   23.7
59      49.6   23.8
62      42.7   24.2
70      43.9   22.3
85      43.0   21.7
94      36.5   22.2
99      42.3   25.4
102     36.3   23.8
105     34.3   20.7
112     38.0   21.8
129     49.0   24.7
138     28.9   20.8
140     43.9   20.7
143     33.2   20.1
148     49.0   25.4
176     48.9   27.0
177     30.2   20.2
184     43.0   26.2
186     45.1   22.6
199     42.0   25.5

In [187]:
adver[(adver['Sales'] > 20) & (adver['Radio'] > 35) & (adver['TV'] > 200) & (adver['Radio'] > 40)]

       index     TV  Radio  News  Sales
index
37        37  266.9   43.8   5.0   25.4
48        48  239.9   41.5  18.5   23.2
53        53  216.4   41.7  39.6   22.6
59        59  210.8   49.6  37.7   23.8
62        62  261.3   42.7  54.7   24.2
70        70  216.8   43.9  27.2   22.3
85        85  213.5   43.0  33.8   21.7
99        99  289.7   42.3  51.2   25.4
129      129  220.3   49.0   3.2   24.7
148      148  243.2   49.0  44.3   25.4
176      176  276.9   48.9  41.8   27.0
184      184  287.6   43.0  71.8   26.2
186      186  205.0   45.1  19.6   22.6
199      199  283.6   42.0  66.2   25.5

In [188]:
car=pd.read_csv('car.csv')
car.head(20)

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition
0,Acura,Integra,16.919,16.360,0.000,21.500,1.800,140.000,101.200,67.300,172.400,2.639,13.200,28.000,2.828,0.0
1,Acura,TL,39.384,19.875,0.000,28.400,3.200,225.000,108.100,70.300,192.900,3.517,17.200,25.000,3.673,0.0
2,Acura,CL,14.114,18.225,0.000,$null$,3.200,225.000,106.900,70.600,192.000,3.470,17.200,26.000,2.647,0.0
3,Acura,RL,8.588,29.725,0.000,42.000,3.500,210.000,114.600,71.400,196.600,3.850,18.000,22.000,2.150,0.0
4,Audi,A4,20.397,22.255,0.000,23.990,1.800,150.000,102.600,68.200,178.000,2.998,16.400,27.000,3.015,0.0
5,Audi,A6,18.780,23.555,0.000,33.950,2.800,200.000,108.700,76.100,192.000,3.561,18.500,22.000,2.933,0.0
6,Audi,A8,1.380,39.000,0.000,62.000,4.200,310.000,113.000,74.000,198.200,3.902,23.700,21.000,0.322,0.0
7,BMW,323i,19.747,$null$,0.000,26.990,2.500,170.000,107.300,68.400,176.000,3.179,16.600,26.100,2.983,0.0
8,BMW,328i,9.231,28.675,0.000,33.400,2.800,193.000,107.300,68.500,176.000,3.197,16.600,24.000,2.223,0.0
9,BMW,528i,17.527,36.125,0.000,38.900,2.800,193.000,111.400,70.900,188.000,3.472,18.500,24.800,2.864,0.0
10,Buick,Century,91.561,12.475,0.000,21.975,3.100,175.000,109.000,72.700,194.600,3.368,17.500,25.000,4.517,0.0
11,Buick,Regal,39.350,13.740,0.000,25.300,3.800,240.000,109.000,72.700,196.200,3.543,17.500,23.000,3.672,0.0
12,Buick,Park Avenue,27.851,20.190,0.000,31.965,3.800,205.000,113.800,74.700,206.800,3.778,18.500,24.000,3.327,0.0
13,Buick,LeSabre,83.257,13.360,0.000,27.885,3.800,205.000,112.200,73.500,200.000,3.591,17.500,25.000,4.422,0.0
14,Cadillac,DeVille,63.729,22.525,0.000,39.895,4.600,275.000,115.300,74.500,207.200,3.978,18.500,22.000,4.155,0.0
15,Cadillac,Seville,15.943,27.100,0.000,44.475,4.600,275.000,112.200,75.000,201.000,$null$,18.500,22.000,2.769,0.0
16,Cadillac,Eldorado,6.536,25.725,0.000,39.665,4.600,275.000,108.000,75.500,200.600,3.843,19.000,22.000,1.877,0.0
17,Cadillac,Catera,11.185,18.225,0.000,31.010,3.000,200.000,107.400,70.300,194.800,3.770,18.000,22.000,2.415,0.0
18,Cadillac,Escalade,14.785,$null$,1.000,46.225,5.700,255.000,117.500,77.000,201.200,5.572,30.000,15.000,2.694,0.0
19,Chevrolet,Cavalier,145.519,9.250,0.000,13.260,2.200,115.000,104.100,67.900,180.900,2.676,14.300,27.000,4.980,0.0

In [352]:
car[car['manufact'].str.contains('BMW', case=False , na= False)].sort_values('wheelbas')
#na=False , always have to be

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition,production,nproduction,sales_cat,Influence
7,BMW,323i,19.747,$null$,0.000,26.99,2.500,170.000,107.300,68.400,176.000,3.179,16.600,26.100,2.983,0.0,1954,1960,1,Some Influence
8,BMW,328i,9.231,28.675,0.000,33.40,2.800,193.000,107.300,68.500,176.000,3.197,16.600,24.000,2.223,0.0,1954,1960,1,Very Influence
9,BMW,528i,17.527,36.125,0.000,38.90,2.800,193.000,111.400,70.900,188.000,3.472,18.500,24.800,2.864,0.0,1954,1960,1,Very Influence

In [190]:
car[car['manufact'].str.contains('BMW|Audi', case=False , na= False)]
#   |    : means  or

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition
4,Audi,A4,20.397,22.255,0.000,23.990,1.800,150.000,102.600,68.200,178.000,2.998,16.400,27.000,3.015,0.0
5,Audi,A6,18.780,23.555,0.000,33.950,2.800,200.000,108.700,76.100,192.000,3.561,18.500,22.000,2.933,0.0
6,Audi,A8,1.380,39.000,0.000,62.000,4.200,310.000,113.000,74.000,198.200,3.902,23.700,21.000,0.322,0.0
7,BMW,323i,19.747,$null$,0.000,26.990,2.500,170.000,107.300,68.400,176.000,3.179,16.600,26.100,2.983,0.0
8,BMW,328i,9.231,28.675,0.000,33.400,2.800,193.000,107.300,68.500,176.000,3.197,16.600,24.000,2.223,0.0
9,BMW,528i,17.527,36.125,0.000,38.900,2.800,193.000,111.400,70.900,188.000,3.472,18.500,24.800,2.864,0.0

In [191]:
car[car['price'].isin([33.950])]

Empty DataFrame
Columns: [manufact, model, sales, resale, type, price, engine_s, horsepow, wheelbas, width, length, curb_wgt, fuel_cap, mpg, lnsales, partition]
Index: []

In [192]:
car[car['manufact'].isin(['Honda'])]

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition
57,Honda,Civic,199.685,9.850,0.000,12.885,1.600,106.000,103.200,67.100,175.100,2.339,11.900,32.000,5.297,0.0
58,Honda,Accord,230.902,13.210,0.000,15.350,2.300,135.000,106.900,70.300,188.800,2.932,17.100,27.000,5.442,0.0
59,Honda,CR-V,73.203,17.710,1.000,20.550,2.000,146.000,103.200,68.900,177.600,3.219,15.300,24.000,4.293,0.0
60,Honda,Passport,12.855,17.525,1.000,26.600,3.200,205.000,106.400,70.400,178.200,3.857,21.100,19.000,2.554,0.0
61,Honda,Odyssey,76.029,19.490,1.000,26.000,3.500,210.000,118.100,75.600,201.200,4.288,20.000,23.000,4.331,0.0

In [193]:
car[car['manufact'].str.contains('B',na=False)]
#na=False , always have to be

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition
7,BMW,323i,19.747,$null$,0.000,26.990,2.500,170.000,107.300,68.400,176.000,3.179,16.600,26.100,2.983,0.0
8,BMW,328i,9.231,28.675,0.000,33.400,2.800,193.000,107.300,68.500,176.000,3.197,16.600,24.000,2.223,0.0
9,BMW,528i,17.527,36.125,0.000,38.900,2.800,193.000,111.400,70.900,188.000,3.472,18.500,24.800,2.864,0.0
10,Buick,Century,91.561,12.475,0.000,21.975,3.100,175.000,109.000,72.700,194.600,3.368,17.500,25.000,4.517,0.0
11,Buick,Regal,39.350,13.740,0.000,25.300,3.800,240.000,109.000,72.700,196.200,3.543,17.500,23.000,3.672,0.0
12,Buick,Park Avenue,27.851,20.190,0.000,31.965,3.800,205.000,113.800,74.700,206.800,3.778,18.500,24.000,3.327,0.0
13,Buick,LeSabre,83.257,13.360,0.000,27.885,3.800,205.000,112.200,73.500,200.000,3.591,17.500,25.000,4.422,0.0
92,Mercedes-Benz,C-Class,18.392,26.050,0.000,31.750,2.300,185.000,105.900,67.700,177.400,3.250,16.400,26.000,2.912,0.0
93,Mercedes-Benz,E-Class,27.602,41.450,0.000,49.900,3.200,221.000,111.500,70.800,189.400,3.823,21.100,25.000,3.318,0.0
94,Mercedes-Benz,S-Class,16.774,50.375,0.000,69.700,4.300,275.000,121.500,73.100,203.100,4.133,23.200,21.000,2.820,0.0
95,Mercedes-Benz,SL-Class,3.311,58.600,0.000,82.600,5.000,302.000,99.000,71.300,177.100,4.125,21.100,20.000,1.197,0.0
96,Mercedes-Benz,SLK,7.998,$null$,0.000,38.900,2.300,190.000,94.500,67.500,157.900,3.055,15.900,26.000,2.079,0.0
97,Mercedes-Benz,SLK230,1.526,$null$,0.000,41.000,2.300,185.000,94.500,67.500,157.300,2.975,14.000,27.000,0.423,0.0
98,Mercedes-Benz,CLK Coupe,11.592,$null$,0.000,41.600,3.200,215.000,105.900,67.800,180.300,3.213,16.400,26.000,2.450,0.0
99,Mercedes-Benz,CL500,0.954,$null$,0.000,85.500,5.000,302.000,113.600,73.100,196.600,4.115,23.200,20.000,-0.047,0.0
100,Mercedes-Benz,M-Class,28.976,$null$,1.000,35.300,3.200,215.000,111.000,72.200,180.600,4.387,19.000,20.000,3.366,0.0

In [194]:
car.query('price == 31.750')

Empty DataFrame
Columns: [manufact, model, sales, resale, type, price, engine_s, horsepow, wheelbas, width, length, curb_wgt, fuel_cap, mpg, lnsales, partition]
Index: []

In [195]:
car['sales'].dtype

dtype('O')

In [196]:
car['sales'] = pd.to_numeric(car['sales'], errors='coerce')
car.query('manufact == "Cadillac" and sales >= 10')
#  and  : means another condition

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition
14,Cadillac,DeVille,63.729,22.525,0.000,39.895,4.600,275.000,115.300,74.500,207.200,3.978,18.500,22.000,4.155,0.0
15,Cadillac,Seville,15.943,27.100,0.000,44.475,4.600,275.000,112.200,75.000,201.000,$null$,18.500,22.000,2.769,0.0
17,Cadillac,Catera,11.185,18.225,0.000,31.010,3.000,200.000,107.400,70.300,194.800,3.770,18.000,22.000,2.415,0.0
18,Cadillac,Escalade,14.785,$null$,1.000,46.225,5.700,255.000,117.500,77.000,201.200,5.572,30.000,15.000,2.694,0.0

In [197]:
print('str.contains  :  for just words and you can search with one letter or full word \nisin  :  for word and numbers and you can search with full letters of word or number\nstartwith  :  for just words and you can just search first letters of word and it just shows letters that are firs\n but   str.contains  shows letters in all word\nquery  :  for word and numbers and you can search with full letters of word or number')

str.contains  :  for just words and you can search with one letter or full word
isin  :  for word and numbers and you can search with full letters of word or number
startwith  :  for just words and you can just search first letters of word and it just shows letters that are firs
 but   str.contains  shows letters in all word
query  :  for word and numbers and you can search with full letters of word or number

### Adding / Removing Columns

In [198]:
car['production'] = 1954

In [199]:
car.head()

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition,production
0,Acura,Integra,16.919,16.360,0.000,21.500,1.800,140.000,101.200,67.300,172.400,2.639,13.200,28.000,2.828,0.0,1954
1,Acura,TL,39.384,19.875,0.000,28.400,3.200,225.000,108.100,70.300,192.900,3.517,17.200,25.000,3.673,0.0,1954
2,Acura,CL,14.114,18.225,0.000,$null$,3.200,225.000,106.900,70.600,192.000,3.470,17.200,26.000,2.647,0.0,1954
3,Acura,RL,8.588,29.725,0.000,42.000,3.500,210.000,114.600,71.400,196.600,3.850,18.000,22.000,2.150,0.0,1954
4,Audi,A4,20.397,22.255,0.000,23.990,1.800,150.000,102.600,68.200,178.000,2.998,16.400,27.000,3.015,0.0,1954

In [200]:
import numpy as np
# just for when that we have 2 types not here that we have lots of types
car['nproduction'] = np.where(car['manufact']=='BMW',1960,1954)
car[car['manufact'].str.contains('B',na=False)]

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition,production,nproduction
7,BMW,323i,19.747,$null$,0.000,26.990,2.500,170.000,107.300,68.400,176.000,3.179,16.600,26.100,2.983,0.0,1954,1960
8,BMW,328i,9.231,28.675,0.000,33.400,2.800,193.000,107.300,68.500,176.000,3.197,16.600,24.000,2.223,0.0,1954,1960
9,BMW,528i,17.527,36.125,0.000,38.900,2.800,193.000,111.400,70.900,188.000,3.472,18.500,24.800,2.864,0.0,1954,1960
10,Buick,Century,91.561,12.475,0.000,21.975,3.100,175.000,109.000,72.700,194.600,3.368,17.500,25.000,4.517,0.0,1954,1954
11,Buick,Regal,39.350,13.740,0.000,25.300,3.800,240.000,109.000,72.700,196.200,3.543,17.500,23.000,3.672,0.0,1954,1954
12,Buick,Park Avenue,27.851,20.190,0.000,31.965,3.800,205.000,113.800,74.700,206.800,3.778,18.500,24.000,3.327,0.0,1954,1954
13,Buick,LeSabre,83.257,13.360,0.000,27.885,3.800,205.000,112.200,73.500,200.000,3.591,17.500,25.000,4.422,0.0,1954,1954
92,Mercedes-Benz,C-Class,18.392,26.050,0.000,31.750,2.300,185.000,105.900,67.700,177.400,3.250,16.400,26.000,2.912,0.0,1954,1954
93,Mercedes-Benz,E-Class,27.602,41.450,0.000,49.900,3.200,221.000,111.500,70.800,189.400,3.823,21.100,25.000,3.318,0.0,1954,1954
94,Mercedes-Benz,S-Class,16.774,50.375,0.000,69.700,4.300,275.000,121.500,73.100,203.100,4.133,23.200,21.000,2.820,0.0,1954,1954
95,Mercedes-Benz,SL-Class,3.311,58.600,0.000,82.600,5.000,302.000,99.000,71.300,177.100,4.125,21.100,20.000,1.197,0.0,1954,1954
96,Mercedes-Benz,SLK,7.998,$null$,0.000,38.900,2.300,190.000,94.500,67.500,157.900,3.055,15.900,26.000,2.079,0.0,1954,1954
97,Mercedes-Benz,SLK230,1.526,$null$,0.000,41.000,2.300,185.000,94.500,67.500,157.300,2.975,14.000,27.000,0.423,0.0,1954,1954
98,Mercedes-Benz,CLK Coupe,11.592,$null$,0.000,41.600,3.200,215.000,105.900,67.800,180.300,3.213,16.400,26.000,2.450,0.0,1954,1954
99,Mercedes-Benz,CL500,0.954,$null$,0.000,85.500,5.000,302.000,113.600,73.100,196.600,4.115,23.200,20.000,-0.047,0.0,1954,1954
100,Mercedes-Benz,M-Class,28.976,$null$,1.000,35.300,3.200,215.000,111.000,72.200,180.600,4.387,19.000,20.000,3.366,0.0,1954,1954

In [201]:
car.drop(columns=['production'])

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition,nproduction
0,Acura,Integra,16.919,16.360,0.000,21.500,1.800,140.000,101.200,67.300,172.400,2.639,13.200,28.000,2.828,0.0,1954
1,Acura,TL,39.384,19.875,0.000,28.400,3.200,225.000,108.100,70.300,192.900,3.517,17.200,25.000,3.673,0.0,1954
2,Acura,CL,14.114,18.225,0.000,$null$,3.200,225.000,106.900,70.600,192.000,3.470,17.200,26.000,2.647,0.0,1954
3,Acura,RL,8.588,29.725,0.000,42.000,3.500,210.000,114.600,71.400,196.600,3.850,18.000,22.000,2.150,0.0,1954
4,Audi,A4,20.397,22.255,0.000,23.990,1.800,150.000,102.600,68.200,178.000,2.998,16.400,27.000,3.015,0.0,1954
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
154,Volvo,V70,17.531,$null$,0.000,28.800,2.400,168.000,104.900,69.300,186.200,3.259,17.900,25.000,2.864,0.0,1954
155,Volvo,C70,3.493,$null$,0.000,45.500,2.300,236.000,104.900,71.500,185.700,3.601,18.500,23.000,1.251,0.0,1954
156,Volvo,S80,18.969,$null$,0.000,36.000,2.900,201.000,109.900,72.100,189.800,3.600,21.100,24.000,2.943,0.0,1954
157,NaN,newCar,NaN,$null$,$null$,21.500,1.500,76.000,106.300,67.900,175.000,2.932,11.900,46.000,$null$,1.0,1954
158,NaN,newTruck,NaN,$null$,$null$,34.200,3.500,167.000,109.800,75.200,188.400,4.508,17.200,26.000,$null$,1.0,1954

In [202]:
car_new=pd.read_csv('car.csv')
car_new.head()

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition
0,Acura,Integra,16.919,16.360,0.000,21.500,1.800,140.000,101.200,67.300,172.400,2.639,13.200,28.000,2.828,0.0
1,Acura,TL,39.384,19.875,0.000,28.400,3.200,225.000,108.100,70.300,192.900,3.517,17.200,25.000,3.673,0.0
2,Acura,CL,14.114,18.225,0.000,$null$,3.200,225.000,106.900,70.600,192.000,3.470,17.200,26.000,2.647,0.0
3,Acura,RL,8.588,29.725,0.000,42.000,3.500,210.000,114.600,71.400,196.600,3.850,18.000,22.000,2.150,0.0
4,Audi,A4,20.397,22.255,0.000,23.990,1.800,150.000,102.600,68.200,178.000,2.998,16.400,27.000,3.015,0.0

In [203]:
car_new['production'] = 1950
car_new.head()

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition,production
0,Acura,Integra,16.919,16.360,0.000,21.500,1.800,140.000,101.200,67.300,172.400,2.639,13.200,28.000,2.828,0.0,1950
1,Acura,TL,39.384,19.875,0.000,28.400,3.200,225.000,108.100,70.300,192.900,3.517,17.200,25.000,3.673,0.0,1950
2,Acura,CL,14.114,18.225,0.000,$null$,3.200,225.000,106.900,70.600,192.000,3.470,17.200,26.000,2.647,0.0,1950
3,Acura,RL,8.588,29.725,0.000,42.000,3.500,210.000,114.600,71.400,196.600,3.850,18.000,22.000,2.150,0.0,1950
4,Audi,A4,20.397,22.255,0.000,23.990,1.800,150.000,102.600,68.200,178.000,2.998,16.400,27.000,3.015,0.0,1950

In [204]:
car_new['sales'] = pd.to_numeric(car_new['sales'], errors='coerce')
car_new['price'] = pd.to_numeric(car_new['price'], errors='coerce')

car_new['profit']=car_new['sales'] * car_new['price'] - car_new['price'] / 10

In [205]:
car_new.head()

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition,production,profit
0,Acura,Integra,16.919,16.360,0.000,21.50,1.800,140.000,101.200,67.300,172.400,2.639,13.200,28.000,2.828,0.0,1950,361.60850
1,Acura,TL,39.384,19.875,0.000,28.40,3.200,225.000,108.100,70.300,192.900,3.517,17.200,25.000,3.673,0.0,1950,1115.66560
2,Acura,CL,14.114,18.225,0.000,NaN,3.200,225.000,106.900,70.600,192.000,3.470,17.200,26.000,2.647,0.0,1950,NaN
3,Acura,RL,8.588,29.725,0.000,42.00,3.500,210.000,114.600,71.400,196.600,3.850,18.000,22.000,2.150,0.0,1950,356.49600
4,Audi,A4,20.397,22.255,0.000,23.99,1.800,150.000,102.600,68.200,178.000,2.998,16.400,27.000,3.015,0.0,1950,486.92503

In [206]:
car_new.rename(columns={'profit':'pprofit'},inplace=True)

In [207]:
carnew=car.copy()
carnew.head()

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition,production,nproduction
0,Acura,Integra,16.919,16.360,0.000,21.500,1.800,140.000,101.200,67.300,172.400,2.639,13.200,28.000,2.828,0.0,1954,1954
1,Acura,TL,39.384,19.875,0.000,28.400,3.200,225.000,108.100,70.300,192.900,3.517,17.200,25.000,3.673,0.0,1954,1954
2,Acura,CL,14.114,18.225,0.000,$null$,3.200,225.000,106.900,70.600,192.000,3.470,17.200,26.000,2.647,0.0,1954,1954
3,Acura,RL,8.588,29.725,0.000,42.000,3.500,210.000,114.600,71.400,196.600,3.850,18.000,22.000,2.150,0.0,1954,1954
4,Audi,A4,20.397,22.255,0.000,23.990,1.800,150.000,102.600,68.200,178.000,2.998,16.400,27.000,3.015,0.0,1954,1954

In [208]:
mem=pd.read_csv('memb.csv')
mem.head()

   index                  names               CompanyName              Source
0      0    Charlene Barshefsky  American Express Company  Bloomberg Research
1      1           Ursula Burns  American Express Company  Bloomberg Research
2      2       Kenneth Chenault  American Express Company  Bloomberg Research
3      3          Peter Chernin  American Express Company  Bloomberg Research
4      4  Anne Lauvergeon Ph.D.  American Express Company  Bloomberg Research

In [209]:
mem['namess']=mem['names'].str.split(' ').str[0]
mem

,index,names,CompanyName,Source,namess
0,0,Charlene Barshefsky,American Express Company,Bloomberg Research,Charlene
1,1,Ursula Burns,American Express Company,Bloomberg Research,Ursula
2,2,Kenneth Chenault,American Express Company,Bloomberg Research,Kenneth
3,3,Peter Chernin,American Express Company,Bloomberg Research,Peter
4,4,Anne Lauvergeon Ph.D.,American Express Company,Bloomberg Research,Anne
...,...,...,...,...,...
403,403,Linda Alvarado,3M,Bloomberg Research,Linda
404,404,Robert Ulrich,3M,Bloomberg Research,Robert
405,405,Muhtar Kent,3M,Bloomberg Research,Muhtar
406,406,Thomas Brown,3M,Bloomberg Research,Thomas
407,407,Sondra Barbour,3M,Bloomberg Research,Sondra

In [210]:
mem.query('namess == "Anne"')

,index,names,CompanyName,Source,namess
4,4,Anne Lauvergeon Ph.D.,American Express Company,Bloomberg Research,Anne
188,188,Anne Mulcahy,Johnson & Johnson,Bloomberg Research,Anne

In [211]:
soc=pd.read_csv('C:\python_projects\ML\goal.csv')

<>:1: SyntaxWarning: invalid escape sequence '\p'
<>:1: SyntaxWarning: invalid escape sequence '\p'
C:\Users\hessa\AppData\Local\Temp\ipykernel_6912\2751255191.py:1: SyntaxWarning: invalid escape sequence '\p'
  soc=pd.read_csv('C:\python_projects\ML\goal.csv')

In [212]:
soc.info()
#we have to convert data from object(string) to datetime

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44447 entries, 0 to 44446
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       44447 non-null  object
 1   home_team  44447 non-null  object
 2   away_team  44447 non-null  object
 3   team       44447 non-null  object
 4   scorer     44399 non-null  object
 5   minute     44191 non-null  float64
 6   own_goal   44447 non-null  bool
 7   penalty    44447 non-null  bool
dtypes: bool(2), float64(1), object(5)
memory usage: 2.1+ MB

In [213]:
soc['date_goal']=pd.to_datetime(soc['date'])
soc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 44447 entries, 0 to 44446
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       44447 non-null  object
 1   home_team  44447 non-null  object
 2   away_team  44447 non-null  object
 3   team       44447 non-null  object
 4   scorer     44399 non-null  object
 5   minute     44191 non-null  float64
 6   own_goal   44447 non-null  bool
 7   penalty    44447 non-null  bool
 8   date_goal  44447 non-null  datetime64[ns]
dtypes: bool(2), datetime64[ns](1), float64(1), object(5)
memory usage: 2.5+ MB

In [214]:
soc['date_year']=soc['date_goal'].dt.year
soc[['date','date_goal','date_year']]

             date  date_goal  date_year
0      1916-07-02 1916-07-02       1916
1      1916-07-02 1916-07-02       1916
2      1916-07-02 1916-07-02       1916
3      1916-07-02 1916-07-02       1916
4      1916-07-06 1916-07-06       1916
...           ...        ...        ...
44442  2025-07-02 2025-07-02       2025
44443  2025-07-02 2025-07-02       2025
44444  2025-07-06 2025-07-06       2025
44445  2025-07-06 2025-07-06       2025
44446  2025-07-06 2025-07-06       2025

[44447 rows x 3 columns]

In [215]:
soc['date_year']=soc['date_goal'].dt.is_leap_year#سال کبیسه 
soc[['date','date_goal','date_year']].head(12)

          date  date_goal  date_year
0   1916-07-02 1916-07-02       True
1   1916-07-02 1916-07-02       True
2   1916-07-02 1916-07-02       True
3   1916-07-02 1916-07-02       True
4   1916-07-06 1916-07-06       True
5   1916-07-06 1916-07-06       True
6   1916-07-06 1916-07-06       True
7   1916-07-06 1916-07-06       True
8   1916-07-06 1916-07-06       True
9   1916-07-06 1916-07-06       True
10  1916-07-06 1916-07-06       True
11  1916-07-08 1916-07-08       True

In [216]:
soc['date_year']=soc['date_goal'].dt.dayofweek
soc[['date','date_goal','date_year']].head(12)

          date  date_goal  date_year
0   1916-07-02 1916-07-02          6
1   1916-07-02 1916-07-02          6
2   1916-07-02 1916-07-02          6
3   1916-07-02 1916-07-02          6
4   1916-07-06 1916-07-06          3
5   1916-07-06 1916-07-06          3
6   1916-07-06 1916-07-06          3
7   1916-07-06 1916-07-06          3
8   1916-07-06 1916-07-06          3
9   1916-07-06 1916-07-06          3
10  1916-07-06 1916-07-06          3
11  1916-07-08 1916-07-08          5

In [217]:
soc['date_year']=soc['date_goal'].dt.day
soc[['date','date_goal','date_year']].head(12)

          date  date_goal  date_year
0   1916-07-02 1916-07-02          2
1   1916-07-02 1916-07-02          2
2   1916-07-02 1916-07-02          2
3   1916-07-02 1916-07-02          2
4   1916-07-06 1916-07-06          6
5   1916-07-06 1916-07-06          6
6   1916-07-06 1916-07-06          6
7   1916-07-06 1916-07-06          6
8   1916-07-06 1916-07-06          6
9   1916-07-06 1916-07-06          6
10  1916-07-06 1916-07-06          6
11  1916-07-08 1916-07-08          8

In [218]:
soc['date_year']=soc['date_goal'].dt.day_of_year
soc[['date','date_goal','date_year']].head(12)

          date  date_goal  date_year
0   1916-07-02 1916-07-02        184
1   1916-07-02 1916-07-02        184
2   1916-07-02 1916-07-02        184
3   1916-07-02 1916-07-02        184
4   1916-07-06 1916-07-06        188
5   1916-07-06 1916-07-06        188
6   1916-07-06 1916-07-06        188
7   1916-07-06 1916-07-06        188
8   1916-07-06 1916-07-06        188
9   1916-07-06 1916-07-06        188
10  1916-07-06 1916-07-06        188
11  1916-07-08 1916-07-08        190

In [219]:
soc['date_year']=soc['date_goal'].dt.month
soc[['date','date_goal','date_year']].head(12)

          date  date_goal  date_year
0   1916-07-02 1916-07-02          7
1   1916-07-02 1916-07-02          7
2   1916-07-02 1916-07-02          7
3   1916-07-02 1916-07-02          7
4   1916-07-06 1916-07-06          7
5   1916-07-06 1916-07-06          7
6   1916-07-06 1916-07-06          7
7   1916-07-06 1916-07-06          7
8   1916-07-06 1916-07-06          7
9   1916-07-06 1916-07-06          7
10  1916-07-06 1916-07-06          7
11  1916-07-08 1916-07-08          7

In [220]:
soc['date_goall']=pd.to_datetime(soc['date'],format="%Y-%m-%d")
#use format for some dates that are first day-month-year or other types of dates , every of them has a cheat spell
soc['date_goall'].head(12)

0    1916-07-02
1    1916-07-02
2    1916-07-02
3    1916-07-02
4    1916-07-06
5    1916-07-06
6    1916-07-06
7    1916-07-06
8    1916-07-06
9    1916-07-06
10   1916-07-06
11   1916-07-08
Name: date_goall, dtype: datetime64[ns]

In [221]:
soc[['date','date_goal','date_year']].to_csv('C:\python_projects\ML\soc.csv',index=False)
#it save the new editing dataset in the path

<>:1: SyntaxWarning: invalid escape sequence '\p'
<>:1: SyntaxWarning: invalid escape sequence '\p'
C:\Users\hessa\AppData\Local\Temp\ipykernel_6912\1191727056.py:1: SyntaxWarning: invalid escape sequence '\p'
  soc[['date','date_goal','date_year']].to_csv('C:\python_projects\ML\soc.csv',index=False)

In [222]:
car.head(40)

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition,production,nproduction
0,Acura,Integra,16.919,16.360,0.000,21.500,1.800,140.000,101.200,67.300,172.400,2.639,13.200,28.000,2.828,0.0,1954,1954
1,Acura,TL,39.384,19.875,0.000,28.400,3.200,225.000,108.100,70.300,192.900,3.517,17.200,25.000,3.673,0.0,1954,1954
2,Acura,CL,14.114,18.225,0.000,$null$,3.200,225.000,106.900,70.600,192.000,3.470,17.200,26.000,2.647,0.0,1954,1954
3,Acura,RL,8.588,29.725,0.000,42.000,3.500,210.000,114.600,71.400,196.600,3.850,18.000,22.000,2.150,0.0,1954,1954
4,Audi,A4,20.397,22.255,0.000,23.990,1.800,150.000,102.600,68.200,178.000,2.998,16.400,27.000,3.015,0.0,1954,1954
5,Audi,A6,18.780,23.555,0.000,33.950,2.800,200.000,108.700,76.100,192.000,3.561,18.500,22.000,2.933,0.0,1954,1954
6,Audi,A8,1.380,39.000,0.000,62.000,4.200,310.000,113.000,74.000,198.200,3.902,23.700,21.000,0.322,0.0,1954,1954
7,BMW,323i,19.747,$null$,0.000,26.990,2.500,170.000,107.300,68.400,176.000,3.179,16.600,26.100,2.983,0.0,1954,1960
8,BMW,328i,9.231,28.675,0.000,33.400,2.800,193.000,107.300,68.500,176.000,3.197,16.600,24.000,2.223,0.0,1954,1960
9,BMW,528i,17.527,36.125,0.000,38.900,2.800,193.000,111.400,70.900,188.000,3.472,18.500,24.800,2.864,0.0,1954,1960
10,Buick,Century,91.561,12.475,0.000,21.975,3.100,175.000,109.000,72.700,194.600,3.368,17.500,25.000,4.517,0.0,1954,1954
11,Buick,Regal,39.350,13.740,0.000,25.300,3.800,240.000,109.000,72.700,196.200,3.543,17.500,23.000,3.672,0.0,1954,1954
12,Buick,Park Avenue,27.851,20.190,0.000,31.965,3.800,205.000,113.800,74.700,206.800,3.778,18.500,24.000,3.327,0.0,1954,1954
13,Buick,LeSabre,83.257,13.360,0.000,27.885,3.800,205.000,112.200,73.500,200.000,3.591,17.500,25.000,4.422,0.0,1954,1954
14,Cadillac,DeVille,63.729,22.525,0.000,39.895,4.600,275.000,115.300,74.500,207.200,3.978,18.500,22.000,4.155,0.0,1954,1954
15,Cadillac,Seville,15.943,27.100,0.000,44.475,4.600,275.000,112.200,75.000,201.000,$null$,18.500,22.000,2.769,0.0,1954,1954
16,Cadillac,Eldorado,6.536,25.725,0.000,39.665,4.600,275.000,108.000,75.500,200.600,3.843,19.000,22.000,1.877,0.0,1954,1954
17,Cadillac,Catera,11.185,18.225,0.000,31.010,3.000,200.000,107.400,70.300,194.800,3.770,18.000,22.000,2.415,0.0,1954,1954
18,Cadillac,Escalade,14.785,$null$,1.000,46.225,5.700,255.000,117.500,77.000,201.200,5.572,30.000,15.000,2.694,0.0,1954,1954
19,Chevrolet,Cavalier,145.519,9.250,0.000,13.260,2.200,115.000,104.100,67.900,180.900,2.676,14.300,27.000,4.980,0.0,1954,1954
20,Chevrolet,Malibu,135.126,11.225,0.000,16.535,3.100,170.000,107.000,69.400,190.400,3.051,15.000,25.000,4.906,0.0,1954,1954
21,Chevrolet,Lumina,24.629,10.310,0.000,18.890,3.100,175.000,107.500,72.500,200.900,3.330,16.600,25.000,3.204,0.0,1954,1954
22,Chevrolet,Monte Carlo,42.593,11.525,0.000,19.390,3.400,180.000,110.500,72.700,197.900,3.340,17.000,27.000,3.752,0.0,1954,1954
23,Chevrolet,Camaro,26.402,13.025,0.000,24.340,3.800,200.000,101.100,74.100,193.200,3.500,16.800,25.000,3.273,0.0,1954,1954
24,Chevrolet,Corvette,17.947,36.225,0.000,45.705,5.700,345.000,104.500,73.600,179.700,3.210,19.100,22.000,2.887,0.0,1954,1954
25,Chevrolet,Prizm,32.299,9.125,0.000,13.960,1.800,120.000,97.100,66.700,174.300,2.398,13.200,33.000,3.475,0.0,1954,1954
26,Chevrolet,Metro,21.855,5.160,0.000,9.235,1.000,55.000,93.100,62.600,149.400,1.895,10.300,45.000,3.084,0.0,1954,1954
27,Chevrolet,Impala,107.995,$null$,0.000,18.890,3.400,180.000,110.500,73.000,200.000,3.389,17.000,27.000,4.682,0.0,1954,1954
28,Chrysler,Sebring Coupe,7.854,12.360,0.000,19.840,2.500,163.000,103.700,69.700,190.900,2.967,15.900,24.000,2.061,0.0,1954,1954
29,Chrysler,Sebring Conv.,32.775,14.180,0.000,24.495,2.500,168.000,106.000,69.200,193.000,3.332,16.000,24.000,3.490,0.0,1954,1954
30,Chrysler,Concorde,31.148,13.725,0.000,22.245,2.700,200.000,113.000,74.400,209.100,3.452,17.000,26.000,3.439,0.0,1954,1954
31,Chrysler,Cirrus,32.306,12.640,0.000,16.480,2.000,132.000,108.000,71.000,186.000,2.911,16.000,27.000,3.475,0.0,1954,1954
32,Chrysler,LHS,13.462,17.325,0.000,28.340,3.500,253.000,113.000,74.400,207.700,3.564,17.000,23.000,2.600,0.0,1954,1954
33,Chrysler,Town & Country,53.480,19.540,1.000,$null$,$null$,$null$,$null$,$null$,$null$,$null$,$null$,$null$,3.979,0.0,1954,1954
34,Chrysler,300M,30.696,$null$,0.000,29.185,3.500,253.000,113.000,74.400,197.800,3.567,17.000,23.000,3.424,0.0,1954,1954
35,Dodge,Neon,76.034,7.750,0.000,12.640,2.000,132.000,105.000,74.400,174.400,2.567,12.500,29.000,4.331,0.0,1954,1954
36,Dodge,Avenger,4.734,12.545,0.000,19.045,2.500,163.000,103.700,69.100,190.200,2.879,15.900,24.000,1.555,0.0,1954,1954
37,Dodge,Stratus,71.186,10.185,0.000,20.230,2.500,168.000,108.000,71.000,186.000,3.058,16.000,24.000,4.265,0.0,1954,1954
38,Dodge,Intrepid,88.028,12.275,0.000,22.505,2.700,202.000,113.000,74.700,203.700,3.489,17.000,$null$,4.478,0.0,1954,1954
39,Dodge,Viper,0.916,58.470,0.000,69.725,8.000,450.000,96.200,75.700,176.700,3.375,19.000,16.000,-0.088,0.0,1954,1954

In [223]:
car['sales_cat'] = car['sales'].apply(
    lambda x: '1' if x < 50 else ('2' if x < 80 else '3')
)
#1:less than 50
#2:from 50 to 80
#3:more than 80

In [224]:
car['sales_cat'].head(40)

0     1
1     1
2     1
3     1
4     1
5     1
6     1
7     1
8     1
9     1
10    3
11    1
12    1
13    3
14    2
15    1
16    1
17    1
18    1
19    3
20    3
21    1
22    1
23    1
24    1
25    1
26    1
27    3
28    1
29    1
30    1
31    1
32    1
33    2
34    1
35    2
36    1
37    2
38    3
39    1
Name: sales_cat, dtype: object

In [225]:
#Use pd.to_numeric with errors='coerce'. This will turn valid numbers into floats and replace $null$ with NaN:
car['price'] = pd.to_numeric(car['price'], errors='coerce')
car.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 159 entries, 0 to 158
Data columns (total 19 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   manufact     157 non-null    object
 1   model        159 non-null    object
 2   sales        157 non-null    float64
 3   resale       159 non-null    object
 4   type         159 non-null    object
 5   price        157 non-null    float64
 6   engine_s     159 non-null    object
 7   horsepow     159 non-null    object
 8   wheelbas     159 non-null    object
 9   width        159 non-null    object
 10  length       159 non-null    object
 11  curb_wgt     159 non-null    object
 12  fuel_cap     159 non-null    object
 13  mpg          159 non-null    object
 14  lnsales      159 non-null    object
 15  partition    159 non-null    float64
 16  production   159 non-null    int64
 17  nproduction  159 non-null    int64
 18  sales_cat    159 non-null    object
dtypes: float64(3), int64(2), object(14)
memory usage: 23.7+ KB

In [226]:
def car_sales(row):
    if row['price'] < 20 and row['sales'] < 16:
        return "Not Influence"
    elif row['price'] < 30 and row['sales'] < 30:
        return "Some Influence"
    else:
        return "Very Influence"
car['Influence'] = car.apply(car_sales,axis=1)

In [227]:
car.head()

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition,production,nproduction,sales_cat,Influence
0,Acura,Integra,16.919,16.360,0.000,21.50,1.800,140.000,101.200,67.300,172.400,2.639,13.200,28.000,2.828,0.0,1954,1954,1,Some Influence
1,Acura,TL,39.384,19.875,0.000,28.40,3.200,225.000,108.100,70.300,192.900,3.517,17.200,25.000,3.673,0.0,1954,1954,1,Very Influence
2,Acura,CL,14.114,18.225,0.000,NaN,3.200,225.000,106.900,70.600,192.000,3.470,17.200,26.000,2.647,0.0,1954,1954,1,Very Influence
3,Acura,RL,8.588,29.725,0.000,42.00,3.500,210.000,114.600,71.400,196.600,3.850,18.000,22.000,2.150,0.0,1954,1954,1,Very Influence
4,Audi,A4,20.397,22.255,0.000,23.99,1.800,150.000,102.600,68.200,178.000,2.998,16.400,27.000,3.015,0.0,1954,1954,1,Some Influence

In [228]:
ad=pd.read_csv('C:\python_projects\ML\Adver.csv')
ad.drop(['index'],axis=1)

<>:1: SyntaxWarning: invalid escape sequence '\p'
<>:1: SyntaxWarning: invalid escape sequence '\p'
C:\Users\hessa\AppData\Local\Temp\ipykernel_6912\3408332011.py:1: SyntaxWarning: invalid escape sequence '\p'
  ad=pd.read_csv('C:\python_projects\ML\Adver.csv')

        TV  Radio  News  Sales
0    230.1   37.8  69.2   22.1
1     44.5   39.3  45.1   10.4
2     17.2   45.9  69.3    9.3
3    151.5   41.3  58.5   18.5
4    180.8   10.8  58.4   12.9
..     ...    ...   ...    ...
195   38.2    3.7  13.8    7.6
196   94.2    4.9   8.1    9.7
197  177.0    9.3   6.4   12.8
198  283.6   42.0  66.2   25.5
199  232.1    8.6   8.7   13.4

[200 rows x 4 columns]

In [229]:
def cat_sales(row):
    if row['TV'] < 180 and row['Sales'] < 16:
        return "Not Influence"
    elif row['TV'] < 210 and row['Sales'] < 20:
        return "Some Influence"
    else:
        return "Very Influence"
ad['Influence'] = ad.apply(cat_sales,axis=1)
#axis = 0 :rows
#axis = 1 : column
ad.head()

   index     TV  Radio  News  Sales       Influence
0      1  230.1   37.8  69.2   22.1  Very Influence
1      2   44.5   39.3  45.1   10.4   Not Influence
2      3   17.2   45.9  69.3    9.3   Not Influence
3      4  151.5   41.3  58.5   18.5  Some Influence
4      5  180.8   10.8  58.4   12.9  Some Influence

### Merging & Concatenating Data

In [230]:
car.head()

,manufact,model,sales,resale,type,price,engine_s,horsepow,wheelbas,width,length,curb_wgt,fuel_cap,mpg,lnsales,partition,production,nproduction,sales_cat,Influence
0,Acura,Integra,16.919,16.360,0.000,21.50,1.800,140.000,101.200,67.300,172.400,2.639,13.200,28.000,2.828,0.0,1954,1954,1,Some Influence
1,Acura,TL,39.384,19.875,0.000,28.40,3.200,225.000,108.100,70.300,192.900,3.517,17.200,25.000,3.673,0.0,1954,1954,1,Very Influence
2,Acura,CL,14.114,18.225,0.000,NaN,3.200,225.000,106.900,70.600,192.000,3.470,17.200,26.000,2.647,0.0,1954,1954,1,Very Influence
3,Acura,RL,8.588,29.725,0.000,42.00,3.500,210.000,114.600,71.400,196.600,3.850,18.000,22.000,2.150,0.0,1954,1954,1,Very Influence
4,Audi,A4,20.397,22.255,0.000,23.99,1.800,150.000,102.600,68.200,178.000,2.998,16.400,27.000,3.015,0.0,1954,1954,1,Some Influence

In [231]:
ath=pd.read_csv('athlete.csv')
athl=ath.copy()
ath[['NOC','Team','Medal']].head()

   NOC            Team Medal
0  CHN           China   NaN
1  CHN           China   NaN
2  DEN         Denmark   NaN
3  DEN  Denmark/Sweden  Gold
4  NED     Netherlands   NaN

In [232]:
ath.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [233]:
athl.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [234]:
import pandas as pd

# Students DataFrame
df1 = pd.DataFrame({
    'student_id': [1, 2, 3],
    'name': ['Ali', 'Sara', 'Reza']
})

# Scores DataFrame
df2 = pd.DataFrame({
    'student_id': [2, 3, 4],
    'score': [85, 90, 75]
})

# Merge using 'student_id' as the key
result = pd.merge(df1, df2, on='student_id', how='inner')
result

   student_id  name  score
0           2  Sara     85
1           3  Reza     90

In [235]:
ath_merg=ath[['Name','NOC']]
athl_merg=athl[['Name','Sport']]

In [236]:
result1 = pd.merge(ath_merg, athl_merg, on='Name', how='inner')
result1.head(12)

                        Name  NOC          Sport
0                  A Dijiang  CHN     Basketball
1                   A Lamusi  CHN           Judo
2        Gunnar Nielsen Aaby  DEN       Football
3       Edgar Lindenau Aabye  DEN     Tug-Of-War
4   Christine Jacoba Aaftink  NED  Speed Skating
5   Christine Jacoba Aaftink  NED  Speed Skating
6   Christine Jacoba Aaftink  NED  Speed Skating
7   Christine Jacoba Aaftink  NED  Speed Skating
8   Christine Jacoba Aaftink  NED  Speed Skating
9   Christine Jacoba Aaftink  NED  Speed Skating
10  Christine Jacoba Aaftink  NED  Speed Skating
11  Christine Jacoba Aaftink  NED  Speed Skating

In [237]:
result2 = pd.merge(ath_merg, athl_merg, on='Name', how='left')
result2.head(12)

                        Name  NOC          Sport
0                  A Dijiang  CHN     Basketball
1                   A Lamusi  CHN           Judo
2        Gunnar Nielsen Aaby  DEN       Football
3       Edgar Lindenau Aabye  DEN     Tug-Of-War
4   Christine Jacoba Aaftink  NED  Speed Skating
5   Christine Jacoba Aaftink  NED  Speed Skating
6   Christine Jacoba Aaftink  NED  Speed Skating
7   Christine Jacoba Aaftink  NED  Speed Skating
8   Christine Jacoba Aaftink  NED  Speed Skating
9   Christine Jacoba Aaftink  NED  Speed Skating
10  Christine Jacoba Aaftink  NED  Speed Skating
11  Christine Jacoba Aaftink  NED  Speed Skating

In [238]:
result3 = pd.merge(ath_merg, athl_merg, on='Name', how='right')
result3.head(12)

                        Name  NOC          Sport
0                  A Dijiang  CHN     Basketball
1                   A Lamusi  CHN           Judo
2        Gunnar Nielsen Aaby  DEN       Football
3       Edgar Lindenau Aabye  DEN     Tug-Of-War
4   Christine Jacoba Aaftink  NED  Speed Skating
5   Christine Jacoba Aaftink  NED  Speed Skating
6   Christine Jacoba Aaftink  NED  Speed Skating
7   Christine Jacoba Aaftink  NED  Speed Skating
8   Christine Jacoba Aaftink  NED  Speed Skating
9   Christine Jacoba Aaftink  NED  Speed Skating
10  Christine Jacoba Aaftink  NED  Speed Skating
11  Christine Jacoba Aaftink  NED  Speed Skating

In [239]:
result4 = pd.merge(ath_merg, athl_merg, on='Name', how='outer')
result4.head(12)

                                         Name  NOC      Sport
0     Gabrielle Marie "Gabby" Adcock (White-)  GBR  Badminton
1         Eleonora Margarida Josephina Scmitt  BRA   Swimming
2         Eleonora Margarida Josephina Scmitt  BRA   Swimming
3         Eleonora Margarida Josephina Scmitt  BRA   Swimming
4         Eleonora Margarida Josephina Scmitt  BRA   Swimming
5                             Jean Hauptmanns  GER  Wrestling
6     Luis ngel Fernando de los Santos Grossi  URU    Cycling
7     Luis ngel Fernando de los Santos Grossi  URU    Cycling
8     Luis ngel Fernando de los Santos Grossi  URU    Cycling
9     Luis ngel Fernando de los Santos Grossi  URU    Cycling
10    Luis ngel Fernando de los Santos Grossi  URU    Cycling
11    Luis ngel Fernando de los Santos Grossi  URU    Cycling

In [240]:
ath_merg = ath_merg.rename(columns={'Name':'ID'})
result5 = pd.merge(ath_merg, athl_merg, left_on='ID', right_on='Name', how='left')
result5.head(12)

                          ID  NOC                      Name          Sport
0                  A Dijiang  CHN                 A Dijiang     Basketball
1                   A Lamusi  CHN                  A Lamusi           Judo
2        Gunnar Nielsen Aaby  DEN       Gunnar Nielsen Aaby       Football
3       Edgar Lindenau Aabye  DEN      Edgar Lindenau Aabye     Tug-Of-War
4   Christine Jacoba Aaftink  NED  Christine Jacoba Aaftink  Speed Skating
5   Christine Jacoba Aaftink  NED  Christine Jacoba Aaftink  Speed Skating
6   Christine Jacoba Aaftink  NED  Christine Jacoba Aaftink  Speed Skating
7   Christine Jacoba Aaftink  NED  Christine Jacoba Aaftink  Speed Skating
8   Christine Jacoba Aaftink  NED  Christine Jacoba Aaftink  Speed Skating
9   Christine Jacoba Aaftink  NED  Christine Jacoba Aaftink  Speed Skating
10  Christine Jacoba Aaftink  NED  Christine Jacoba Aaftink  Speed Skating
11  Christine Jacoba Aaftink  NED  Christine Jacoba Aaftink  Speed Skating

In [241]:
ath_merg = ath_merg.rename(columns={'Name':'ID'})
print("Inner Join = only matching rows from both tables\nLeft Join = all rows from left table + matches from right\nRight Join = all rows from right table + matches from left\nOuter Join = all rows from both tables, fill missing with NaN")

Inner Join = only matching rows from both tables
Left Join = all rows from left table + matches from right
Right Join = all rows from right table + matches from left
Outer Join = all rows from both tables, fill missing with NaN

In [242]:
cafe=pd.read_csv('C:\python_projects\ML\cafe.csv')
cafe.head()

<>:1: SyntaxWarning: invalid escape sequence '\p'
<>:1: SyntaxWarning: invalid escape sequence '\p'
C:\Users\hessa\AppData\Local\Temp\ipykernel_6912\3358272474.py:1: SyntaxWarning: invalid escape sequence '\p'
  cafe=pd.read_csv('C:\python_projects\ML\cafe.csv')

,Order ID,Date,Product,Price,Quantity,Purchase Type,Payment Method,Manager,City
0,10452,07-11-2022,Fries,3.49,573.07,Online,Gift Card,Tom Jackson,London
1,10453,07-11-2022,Beverages,2.95,745.76,Online,Gift Card,Pablo Perez,Madrid
2,10454,07-11-2022,Sides & Other,4.99,200.40,In-store,Gift Card,Joao Silva,Lisbon
3,10455,08-11-2022,Burgers,12.99,569.67,In-store,Credit Card,Walter Muller,Berlin
4,10456,08-11-2022,Chicken Sandwiches,9.95,201.01,In-store,Credit Card,Walter Muller,Berlin

In [243]:
Fries=cafe[cafe['Product']=='Fries'].copy()
Burgers=cafe[cafe['Product']=='Burgers'].copy()
Fries.head()

,Order ID,Date,Product,Price,Quantity,Purchase Type,Payment Method,Manager,City
0,10452,07-11-2022,Fries,3.49,573.07,Online,Gift Card,Tom Jackson,London
5,10457,08-11-2022,Fries,3.49,573.07,In-store,Credit Card,Remy Monet,Paris
9,10462,09-11-2022,Fries,3.49,573.07,In-store,Credit Card,Remy Monet,Paris
14,10467,10-11-2022,Fries,3.49,573.07,In-store,Credit Card,Pablo Perez,Madrid
18,10472,11-11-2022,Fries,3.49,630.37,In-store,Credit Card,Pablo Perez,Madrid

In [244]:
fr_bg=pd.concat([Fries,Burgers])
fr_bg.head(103)
#first Fries , second Burgers . concat in df

,Order ID,Date,Product,Price,Quantity,Purchase Type,Payment Method,Manager,City
0,10452,07-11-2022,Fries,3.49,573.07,Online,Gift Card,Tom Jackson,London
5,10457,08-11-2022,Fries,3.49,573.07,In-store,Credit Card,Remy Monet,Paris
9,10462,09-11-2022,Fries,3.49,573.07,In-store,Credit Card,Remy Monet,Paris
14,10467,10-11-2022,Fries,3.49,573.07,In-store,Credit Card,Pablo Perez,Madrid
18,10472,11-11-2022,Fries,3.49,630.37,In-store,Credit Card,Pablo Perez,Madrid
...,...,...,...,...,...,...,...,...,...
230,10690,25-12-2022,Burgers,12.99,677.44,In-store,Cash,Walter Muller,Berlin
235,10695,26-12-2022,Burgers,12.99,692.84,In-store,Cash,Walter Muller,Berlin
240,10700,27-12-2022,Burgers,12.99,692.84,In-store,Cash,Walter Muller,Berlin
245,10705,28-12-2022,Burgers,12.99,723.63,Drive-thru,Gift Card,Walter Muller,Berlin
250,10710,29-12-2022,Burgers,12.99,754.43,Drive-thru,Gift Card,Walter Muller,Berlin

In [245]:
frbg_merg=pd.merge(Fries,Burgers,on='Product',how='outer')
frbg_merg.head(103)

,Order ID_x,Date_x,Product,Price_x,Quantity_x,Purchase Type_x,Payment Method_x,Manager_x,City_x,Order ID_y,Date_y,Price_y,Quantity_y,Purchase Type_y,Payment Method_y,Manager_y,City_y
0,NaN,NaN,Burgers,NaN,NaN,NaN,NaN,NaN,NaN,10455.0,08-11-2022,12.99,569.67,In-store,Credit Card,Walter Muller,Berlin
1,NaN,NaN,Burgers,NaN,NaN,NaN,NaN,NaN,NaN,10460.0,09-11-2022,12.99,554.27,In-store,Credit Card,Remy Monet,Paris
2,NaN,NaN,Burgers,NaN,NaN,NaN,NaN,NaN,NaN,10465.0,10-11-2022,12.99,554.27,In-store,Credit Card,Pablo Perez,Madrid
3,NaN,NaN,Burgers,NaN,NaN,NaN,NaN,NaN,NaN,10470.0,11-11-2022,12.99,554.27,In-store,Credit Card,Pablo Perez,Madrid
4,NaN,NaN,Burgers,NaN,NaN,NaN,NaN,NaN,NaN,10475.0,12-11-2022,12.99,523.48,In-store,Credit Card,Pablo Perez,Madrid
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
98,10692.0,25-12-2022,Fries,3.49,630.37,In-store,Cash,Walter Muller,Berlin,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
99,10697.0,26-12-2022,Fries,3.49,630.37,In-store,Cash,Walter Muller,Berlin,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
100,10702.0,27-12-2022,Fries,3.49,630.37,In-store,Cash,Walter Muller,Berlin,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
101,10707.0,28-12-2022,Fries,3.49,630.37,Drive-thru,Gift Card,Walter Muller,Berlin,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
102,10712.0,29-12-2022,Fries,3.49,630.37,Drive-thru,Gift Card,Walter Muller,Berlin,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

### Handeling Null values

In [246]:
athlete=pd.read_csv('athlete.csv')
athlete.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [247]:
athlete.loc[[2,3],'Weight'] =np.nan

In [248]:
athlete.head(20)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN
5,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
6,5,Christine Jacoba Aaftink,F,25.0,185.0,82.0,Netherlands,NED,1992 Winter,1992,Winter,Albertville,Speed Skating,Speed Skating Women's 500 metres,NaN
7,5,Christine Jacoba Aaftink,F,25.0,185.0,82.0,Netherlands,NED,1992 Winter,1992,Winter,Albertville,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
8,5,Christine Jacoba Aaftink,F,27.0,185.0,82.0,Netherlands,NED,1994 Winter,1994,Winter,Lillehammer,Speed Skating,Speed Skating Women's 500 metres,NaN
9,5,Christine Jacoba Aaftink,F,27.0,185.0,82.0,Netherlands,NED,1994 Winter,1994,Winter,Lillehammer,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
10,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
11,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 50 kilometres,NaN
12,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10/15 kilometres Pu...,NaN
13,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 4 x 10 kilometres R...,NaN
14,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
15,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 30 kilometres,NaN
16,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 10/15 kilometres Pu...,NaN
17,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 4 x 10 kilometres R...,NaN
18,7,John Aalberg,M,31.0,183.0,72.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
19,7,John Aalberg,M,31.0,183.0,72.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 50 kilometres,NaN

In [249]:
athlete.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB

In [250]:
athlete.isna().sum()
#it means that for example Age has 9474 Nan values

ID             0
Name           0
Sex            0
Age         9474
Height     60171
Weight     62875
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     231333
dtype: int64

In [251]:
athlete['Weight'] = athlete['Weight'].fillna(randint(55,82))

In [252]:
athlete.head(20)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,60.0,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,60.0,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN
5,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
6,5,Christine Jacoba Aaftink,F,25.0,185.0,82.0,Netherlands,NED,1992 Winter,1992,Winter,Albertville,Speed Skating,Speed Skating Women's 500 metres,NaN
7,5,Christine Jacoba Aaftink,F,25.0,185.0,82.0,Netherlands,NED,1992 Winter,1992,Winter,Albertville,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
8,5,Christine Jacoba Aaftink,F,27.0,185.0,82.0,Netherlands,NED,1994 Winter,1994,Winter,Lillehammer,Speed Skating,Speed Skating Women's 500 metres,NaN
9,5,Christine Jacoba Aaftink,F,27.0,185.0,82.0,Netherlands,NED,1994 Winter,1994,Winter,Lillehammer,Speed Skating,"Speed Skating Women's 1,000 metres",NaN
10,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
11,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 50 kilometres,NaN
12,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10/15 kilometres Pu...,NaN
13,6,Per Knut Aaland,M,31.0,188.0,75.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 4 x 10 kilometres R...,NaN
14,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
15,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 30 kilometres,NaN
16,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 10/15 kilometres Pu...,NaN
17,6,Per Knut Aaland,M,33.0,188.0,75.0,United States,USA,1994 Winter,1994,Winter,Lillehammer,Cross Country Skiing,Cross Country Skiing Men's 4 x 10 kilometres R...,NaN
18,7,John Aalberg,M,31.0,183.0,72.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 10 kilometres,NaN
19,7,John Aalberg,M,31.0,183.0,72.0,United States,USA,1992 Winter,1992,Winter,Albertville,Cross Country Skiing,Cross Country Skiing Men's 50 kilometres,NaN

In [253]:
athlete.isna().sum()
#you would see what we have no Nan value for Weight

ID             0
Name           0
Sex            0
Age         9474
Height     60171
Weight         0
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     231333
dtype: int64

In [254]:
athlete.describe()

,ID,Age,Height,Weight,Year
count,271116.000000,261642.000000,210945.000000,271116.000000,271116.000000
mean,68248.954396,25.556898,175.338970,68.220382,1978.378480
std,39022.286345,6.393561,10.518462,13.361361,29.877632
min,1.000000,10.000000,127.000000,25.000000,1896.000000
25%,34643.000000,21.000000,168.000000,60.000000,1960.000000
50%,68205.000000,24.000000,175.000000,64.000000,1988.000000
75%,102097.250000,28.000000,183.000000,75.000000,2002.000000
max,135571.000000,97.000000,226.000000,214.000000,2016.000000

In [255]:
athlete['Height'] = athlete['Height'].fillna(randint(175,200))
athlete['Age'] = athlete['Age'].fillna(randint(25,60))

In [256]:
athlete.isna().sum()
#now we have no Nan value

ID             0
Name           0
Sex            0
Age            0
Height         0
Weight         0
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     231333
dtype: int64

In [257]:
print('Or that better to use mean for Nan values')

Or that better to use mean for Nan values

In [258]:
athlete_Nantest=pd.read_csv('athlete.csv')
athlete_Nantest.loc[[2,3],'Weight'] = np.nan
athlete_Nantest.fillna(athlete_Nantest['Weight'].mean())

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.000000,80.000000,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,70.702393
1,2,A Lamusi,M,23.0,170.000000,60.000000,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,70.702393
2,3,Gunnar Nielsen Aaby,M,24.0,70.702393,70.702393,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,70.702393
3,4,Edgar Lindenau Aabye,M,34.0,70.702393,70.702393,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.000000,82.000000,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,70.702393
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
271111,135569,Andrzej ya,M,29.0,179.000000,89.000000,Poland-1,POL,1976 Winter,1976,Winter,Innsbruck,Luge,Luge Mixed (Men)'s Doubles,70.702393
271112,135570,Piotr ya,M,27.0,176.000000,59.000000,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Individual",70.702393
271113,135570,Piotr ya,M,27.0,176.000000,59.000000,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Team",70.702393
271114,135571,Tomasz Ireneusz ya,M,30.0,185.000000,96.000000,Poland,POL,1998 Winter,1998,Winter,Nagano,Bobsleigh,Bobsleigh Men's Four,70.702393
271115,135571,Tomasz Ireneusz ya,M,34.0,185.000000,96.000000,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Four,70.702393

In [259]:
test_no=pd.read_csv('testt.csv')
test_no.head(10)

  name  age
0    a   12
1    b   23
2    c   No
3    d   45
4    e   No
5    f   56
6    g   75
7    h   34
8    i  653
9    j   No

In [260]:
test_no[test_no['age'].str.contains('No', case=False , na= False)]=np.nan
###BBBEEESSSTTT way for handeling

In [261]:
test_no.isna().sum()
#it got nan values right

name    6
age     6
dtype: int64

In [262]:
test_no.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    18 non-null     object
 1   age     18 non-null     object
dtypes: object(2)
memory usage: 516.0+ bytes

In [263]:
test_no['age'] = test_no['age'].fillna(randint(25,60))

In [264]:
test_no.head(20)

   name  age
0     a   12
1     b   23
2   NaN   50
3     d   45
4   NaN   50
5     f   56
6     g   75
7     h   34
8     i  653
9   NaN   50
10    k   23
11  NaN   50
12  NaN   50
13    n   23
14    o   45
15    p   67
16    q   22
17    r   11
18    s   56
19  NaN   50

In [265]:
test_no0=pd.read_csv('testt.csv')
test_no0.head()

  name age
0    a  12
1    b  23
2    c  No
3    d  45
4    e  No

In [266]:
test_no0['age'] = test_no0['age'].fillna(randint(25,60))

In [267]:
test_no0.head(300)

#you would see that firs we have to detect Nan values with np.nan second we have to handel Nan values with fillna

   name  age
0     a   12
1     b   23
2     c   No
3     d   45
4     e   No
5     f   56
6     g   75
7     h   34
8     i  653
9     j   No
10    k   23
11    l   No
12    m   No
13    n   23
14    o   45
15    p   67
16    q   22
17    r   11
18    s   56
19    t   No
20    u   12
21    v   46
22    w   12
23    x    4

In [268]:
test_no0.loc[test_no0['age']=='No','age']=np.nan

In [269]:
test_no0.isna().sum()

name    0
age     6
dtype: int64

In [273]:
test_no0['age']=test_no0['age'].fillna(randint(25,60))
test_no0.head(300)

   name  age
0     a   12
1     b   23
2     c   49
3     d   45
4     e   49
5     f   56
6     g   75
7     h   34
8     i  653
9     j   49
10    k   23
11    l   49
12    m   49
13    n   23
14    o   45
15    p   67
16    q   22
17    r   11
18    s   56
19    t   49
20    u   12
21    v   46
22    w   12
23    x    4

In [282]:
df_testval[df_testval['Weight'].isna()]=np.nan
df_testval['Weight']=df_testval['Weight'].fillna(randint(120,150))

In [284]:
df_testval[df_testval['Weight'].isna()]

Empty DataFrame
Columns: [ID, Name, Sex, Age, Height, Weight, Team, NOC, Games, Year, Season, City, Sport, Event, Medal, False]
Index: []

In [290]:
df_testval[df_testval['Weight'].notna()]
#to see values that aren`t Nan

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,False
0,1.0,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992.0,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,180.0
1,2.0,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012.0,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,170.0
2,NaN,NaN,NaN,NaN,NaN,123.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,123.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5.0,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988.0,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN,185.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
271111,135569.0,Andrzej ya,M,29.0,179.0,89.0,Poland-1,POL,1976 Winter,1976.0,Winter,Innsbruck,Luge,Luge Mixed (Men)'s Doubles,NaN,179.0
271112,135570.0,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014.0,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Individual",NaN,176.0
271113,135570.0,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014.0,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Team",NaN,176.0
271114,135571.0,Tomasz Ireneusz ya,M,30.0,185.0,96.0,Poland,POL,1998 Winter,1998.0,Winter,Nagano,Bobsleigh,Bobsleigh Men's Four,NaN,185.0
271115,135571.0,Tomasz Ireneusz ya,M,34.0,185.0,96.0,Poland,POL,2002 Winter,2002.0,Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Four,NaN,185.0

#### the summery

In [275]:
print("""If the none was with NaN you have to detect with:
test_no0.loc[[2,4], 'age'] = np.nan
If the none was with another like No , -- or.... you have to detect with:
test_no0.loc[test_no0['age'] == 'No', 'age'] = np.nan""")

If the none was with NaN you have to detect with:
test_no0.loc[[2,4], 'age'] = np.nan
If the none was with another like No , -- or.... you have to detect with:
test_no0.loc[test_no0['age'] == 'No', 'age'] = np.nan

In [287]:
print('the easy way for both is this:\nNaN : df_testval[df_testval[Weight].isna()]=np.nan\nother NaN : df_testval[df_testval[age].isin([No,..,-90])]=np.nan')

the easy way for both is this:
NaN : df_testval[df_testval[Weight].isna()]=np.nan
other NaN : df_testval[df_testval[age].isin([No,..,-90])]=np.nan

In [305]:
print('dropna() : delete the column or row that contain Nan value\nfillna() : fill anything that you given as Nan value\nfor both (very easy way) : interpolate()')

dropna() : delete the column or row that contain Nan value
fillna() : fill anything that you given as Nan value
for both (very easy way) : interpolate()

In [306]:
print('interpolate() : It looks at the numeric values before and after a missing value.\nIt then estimates the missing value using a chosen interpolation method (default is linear)\nThis is especially useful for time series data or continuous numeric sequences.')

interpolate() : It looks at the numeric values before and after a missing value.
It then estimates the missing value using a chosen interpolation method (default is linear)
This is especially useful for time series data or continuous numeric sequences.

### Aggregating Data

In [294]:
athlete.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,188.0,60.0,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,188.0,60.0,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [293]:
athlete['Medal'].value_counts()

Medal
Gold      13372
Bronze    13295
Silver    13116
Name: count, dtype: int64

In [298]:
athlete[athlete['Sport']=='Football']['Team'].value_counts()

Team
Brazil                  306
United States           278
Sweden                  241
Italy                   240
Japan                   220
                       ...
Netherlands Antilles     11
Smyrna                   11
Upton Park FC            11
Univ. of Brussels        11
Estonia                  11
Name: count, Length: 103, dtype: int64

In [308]:
athlete['Height']=athlete['Height'].interpolate()

In [316]:
athlete.groupby(['Sport'])['Height'].mean()

Sport
Aeronautics         188.000000
Alpine Skiing       177.491109
Alpinism            188.000000
Archery             175.669237
Art Competitions    187.779765
                       ...
Tug-Of-War          187.188235
Volleyball          187.030552
Water Polo          185.705408
Weightlifting       172.585471
Wrestling           176.311574
Name: Height, Length: 66, dtype: float64

In [320]:
athlete.groupby(['Sport','Sex']).agg({'Height':'mean','Weight':'mean'})

                       Height     Weight
Sport         Sex
Aeronautics   M    188.000000  60.000000
Alpine Skiing F    171.868452  62.024132
              M    181.009022  72.843767
Alpinism      F    188.000000  60.000000
              M    188.000000  60.000000
...                       ...        ...
Water Polo    M    187.179273  78.448779
Weightlifting F    160.645788  67.724622
              M    174.176742  79.470639
Wrestling     F    163.865132  60.552632
              M    176.863942  71.976058

[116 rows x 2 columns]

In [329]:
pivot = athlete.pivot_table(
    columns='Sport',
    index='Sex',
    values='Height',
    aggfunc='mean'   # or 'max', 'min', 'count'
)
pivot.head()

Sport,Aeronautics,Alpine Skiing,Alpinism,Archery,Art Competitions,Athletics,Badminton,Baseball,Basketball,Basque Pelota,...,Table Tennis,Taekwondo,Tennis,Trampolining,Triathlon,Tug-Of-War,Volleyball,Water Polo,Weightlifting,Wrestling
Sex,,,,,,,,,,,,,,,,,,,,,
F,NaN,171.868452,188.0,169.383251,187.925729,170.313989,170.156757,NaN,182.476911,NaN,...,167.254984,171.214047,175.088285,162.078947,167.076046,NaN,179.759559,175.563525,160.645788,163.865132
M,188.0,181.009022,188.0,180.506444,187.762574,181.318273,179.679219,182.889262,193.510671,188.0,...,177.831337,182.436482,185.995249,171.368421,180.195489,187.188235,193.059108,187.179273,174.176742,176.863942

In [328]:
print('pivot : for unique values , example now we can`t use becuse we have alot of athletes that are in on sex and sport\npivot_table : you can use for every df with duplicates values and you can use mean,sum,..')

pivot : for unique values , example now we can`t use becuse we have alot of athletes that are in on sex and sport
pivot_table : you can use for every df with duplicates values and you can use mean,sum,..

In [333]:
pivot.mean(axis=1)

Sex
F    170.932272
M    182.780228
dtype: float64

In [334]:
pivot.mean(axis=0)

Sport
Aeronautics         188.000000
Alpine Skiing       176.438737
Alpinism            188.000000
Archery             174.944848
Art Competitions    187.844152
                       ...
Tug-Of-War          187.188235
Volleyball          186.409334
Water Polo          181.371399
Weightlifting       167.411265
Wrestling           170.364537
Length: 66, dtype: float64

In [ ]:
athlete.groupby(athlete['Age'])['Name'].count().reset_index().sort_values('Name')
#sort by name from lessest to most

     Age   Name
0   10.0      1
73  97.0      1
72  96.0      1
70  84.0      1
67  77.0      2
..   ...    ...
11  21.0  19164
15  25.0  19707
12  22.0  20814
14  24.0  21720
13  23.0  21875

[74 rows x 2 columns]

In [ ]:
athlete.groupby(athlete['Age'])['Name'].count().reset_index().sort_values('Name',ascending=False)
#sort by name from most to lessest

     Age   Name
13  23.0  21875
14  24.0  21720
12  22.0  20814
15  25.0  19707
11  21.0  19164
..   ...    ...
67  77.0      2
0   10.0      1
70  84.0      1
72  96.0      1
73  97.0      1

[74 rows x 2 columns]

In [350]:
athlete.groupby(athlete['Age'])['Name'].count().reset_index()
#sort by age

     Age  Name
0   10.0     1
1   11.0    13
2   12.0    39
3   13.0   187
4   14.0   837
..   ...   ...
69  81.0     2
70  84.0     1
71  88.0     3
72  96.0     1
73  97.0     1

[74 rows x 2 columns]

In [365]:
athlete.groupby(['Height', 'Weight'])['Name'].count().reset_index().sort_values('Name',ascending=False)

      Height  Weight   Name
2622   188.0    60.0  58956
1166   170.0    60.0   1338
1953   180.0    75.0   1047
1041   168.0    60.0   1013
1946   180.0    70.0   1006
...      ...     ...    ...
3942   219.0   104.0      1
3943   219.0   113.0      1
3945   220.0   112.0      1
3947   221.0   110.0      1
3948   221.0   114.0      1

[3953 rows x 3 columns]

In [354]:
print('reset_index : This is useful when you want to “flatten” the DataFrame after grouping or pivoting.\nTip : before using month or year in born or product column first have to make them to dt.year/month/...')

reset_index : This is useful when you want to “flatten” the DataFrame after grouping or pivoting.
Tip : before using month or year in born or product column first have to make them to dt.year/month/...